import type { Chapter } from "../types";

export const chapterOne: Chapter = {
  id: "dua-start",
  title: "ИСПРАШИВАНИЕ У АЛЛАХА РАЯ И ЗАЩИТЫ ОТ АДА",
  duas: [
    {
      id: 1,
      arabic: "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ",
      transliteration:
        "«Алла́хумма, инни́ ас'алюка-ль-Джанната ва а'узу бика мина-н-На́р(и)».",
      translation: "«О, Аллах! Прошу у Тебя Рая и прибегаю к Твоей защите от Ада».",
    },
    {
      id: 2,
      arabic: "رَبِّ ابْنِ لِي عِندَكَ بَيْتًا فِي الْجَنَّةِ",
      transliteration: "«Рабби-бни ли́ 'индака байтан фи-ль-Джаннат(и)».",
      translation: "«О, Господь! Возведи мне дом в Раю».",
    },
    {
      id: 3,
      arabic:
        "رَبِّ أَلْحِقْنِي بِالصَّالِحِينَ ۝ وَاجْعَل لِّي لِسَانَ صِدْقٍ فِي الْآخِرِينَ ۝ وَاجْعَلْنِي مِن وَرَثَةِ جَنَّةِ النَّعِيمِ ۝",
      transliteration:
        "«Рабби “Альхикни́ би-с-салихи́н(а), ва-дж'аль ли́ лиса́на сидкин фи-ль-а́хири́н(а), ва-дж'альни́ мин варасати джаннати-н-наи́м(и)».",
      translation:
        "«О, Господь! Воссоедини меня с праведниками. Оставь обо мне правдивую молву в последующих поколениях. Сделай меня одним из наследников Сада Блаженства».",
    },
    {
      id: 4,
      arabic: "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا",
      transliteration:
        "«Раббана̄-сриф 'анна̄ 'аза̄ба Джаха̄ннама, инна 'аза̄баха̄ кя̄на гара̄ма(н)».",
      translation:
        "«Господь наш! Отврати от нас мучения в Геене, поскольку мучения там не отступают».",
    },
    {
      id: 5,
      arabic:
        "اللَّهُمَّ رَبَّ جِبْرَائِيلَ وَمِيكَائِيلَ وَرَبَّ إِسْرَافِيلَ، أَعُوذُ بِكَ مِنْ حَرِّ النَّارِ وَمِنْ عَذَابِ الْقَبْرِ",
      transliteration:
        "«Алла́хумма Рабба Джибра́йля, ва Мика́йля, ва Рабба Исрафи́ля, а'у́зу бика мин харри-н-на́ри, ва мин 'аза́би-ль-кабр(и)».",
      translation:
        "«О, Аллах! Господь Джибраиля и Микаиля, и Господь Исрафиля. Прибегаю к Твоей защите от жара адского огня и от могильных мук».",
    },
  ],
};

export const chapterTwo: Chapter = {
  id: "dua-forgiveness-mercy",
  title: "ИСПРАШИВАНИЕ У АЛЛАХА ПРОЩЕНИЯ И МИЛОСТИ",
  duas: [
    {
      id: 1,
      arabic: "رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ",
      transliteration: "«Раббана́ а́манна́ фа-гфир ляна́ зуну́бана, ва кына́ 'аза́ба-н-на́р(и)».",
      translation:
        "«Господь наш! Воистину, мы уверовали. Прости же нам наши грехи и защити нас от мучений в Огне».",
    },
    {
      id: 2,
      arabic:
        "وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ ۝ رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ ۝",
      transliteration:
        "«Ва каффир 'анна́ саййиа́тина ва таваффана́ ма'а-ль-абра́р(и). Раббана́ а́тина ма́ ва'адтана́ 'аля́ русулика ва ля́ тухзина́ йаума-ль-кыя́мати иннакя́ ля́ тухлифу-ль-ми'а́д(а)».",
      translation:
        "«Отпусти нам наши прегрешения и умертви нас вместе с благочестивыми. Господь наш! Даруй нам то, что Ты обещал нам через Своих посланников, и не позорь нас в День воскресения, ведь Ты не нарушаешь обещаний».",
    },
    {
      id: 3,
      arabic: "رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا",
      transliteration: "«Раббана́-гфир ляна́ зуну́бана́ ва исра́фана́ фи́ амрина́».",
      translation:
        "«Господь наш! Прости нам наши грехи и излишества, которые мы допустили в нашем деле».",
    },
    {
      id: 4,
      arabic:
        "رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
      transliteration:
        "«Раббана́ залямна́ анфусана́ ва ин лям тагфир ляна́ ва тархамна́ ланаку́нанна мина-ль-ха́сири́н(а)».",
      translation:
        "«Господь наш! Мы поступили несправедливо по отношению к себе, и если Ты не простишь нас и не смилостивишься над нами, то мы непременно окажемся одними из потерпевших урон».",
    },
    {
      id: 5,
      arabic: "رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الرَّاحِمِينَ",
      transliteration:
        "«Раббана́ а́манна́ фа-гфир ляна́ ва-рхамна́ ва Анта хайру-р- ра́хими́н(а)».",
      translation:
        "«Господь наш! Мы уверовали. Прости же нас и помилуй, ибо Ты — Наилучший из милосердных».",
    },
    {
      id: 6,
      arabic: "رَبِّ اغْفِرْ وَارْحَمْ وَأَنْتَ خَيْرُ الرَّاحِمِينَ",
      transliteration: "«Рабби-гфир, ва-рхам ва Анта хайрy-р-ра́хими́н(а)».",
      translation: "«Господи, прости и помилуй, ведь Ты — Наилучший из милосердных!»",
    },
    {
      id: 7,
      arabic:
        "رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَّحِيمٌ",
      transliteration:
        "«Раббана́-гфир ляна́ ва ли ихва́нина-ллязи́на сабаку́на би-ль-и́ма́ни, ва ля́ тадж'аль фи́ кулю́бина́ гилля-ль-лиллязи́на а́ману, Раббана́ иннака Ра'у́фун Рахи́м(ун)».",
      translation:
        "«Господь наш! Прости нас и наших братьев, которые уверовали раньше нас. Не насаждай в наших сердцах ненависти и зависти к тем, кто уверовал. Господь наш! Воистину, Ты — Сострадательный, Милосердный».",
    },
    {
      id: 8,
      arabic:
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللَّهُ، الْأَحَدُ الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ، أَنْ تَغْفِرَ لِي ذُنُوبِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
      transliteration:
        "«Алла́хумма инни́ ас'алюка йа́ Алла́ху, аль-Ахаду-с-Самаду, аль-лязи́ лям ялид ва лям ю́ляд, ва ля́м якун ляху́ куфуван ахада(ун), ан тагфира ли́ зуну́би, иннака Анта-ль-Гафу́ру-р-Рахи́м(у)».",
      translation:
        "«О Аллах! Поистине, я прошу Тебя, о Аллах, о Единый, Самодостаточный, Который не родил и не был рожден, Которому нет равных, простить мне мои грехи, поистине Ты Прощающий, Милосердный».",
    },
    {
      id: 9,
      arabic:
        "اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي، وَإِسْرَافِي فِي أَمْرِي، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، اللَّهُمَّ اغْفِرْ لِي جِدِّي وَهَزْلِي، وَخَطَئِي وَعَمْدِي، وَكُلُّ ذَلِكَ عِنْدِي، اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ، وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
      transliteration:
        "«Алла́хумма-гфир ли́ хати́'ати́ ва джахли́, ва исра́фи́ фи́ 'амри́, ва ма́ Анта а'ляму бини́ минни́. Алла́хумма-гфир ли́ джидди́ ва хазли́, ва хата́'и́ ва 'амди́, ва куллю за́лика 'инди́. Алла́хумма-гфир ли́ ма́ каддамту ва ма́ аххарту, ва ма́ асрарту ва ма́ а'лянту, ва ма́ Анта а'ляму бихи́ минни́. Анта-ль-Мукаддиму, ва Анта-ль-Му'аххиру, ва Анта 'аля́ кулли шай'ин кади́р(ун)».",
      translation:
        "«О Аллах! Прости мне мой грех и моё невежество, неумеренность в моих делах и то, о чём Ты знаешь лучше меня! О Аллах! Прости мне сделанное мной всерьёз и в шутку, по ошибке и намеренно, ибо всё это мне присуще. О Аллах! Прости мне совершённое мной прежде и то, что ещё не совершено, то, что я совершил тайно, и что совершил явно и то, о чём Ты знаешь лучше меня. Ты — Выдвигающий вперёд, и Ты — Отодвигающий назад и Ты надо всем властен».",
    },
    {
      id: 10,
      arabic:
        "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلٰهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَىٰ عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
      transliteration:
        "«Алла́хумма анта рабби́, ля̄ иля̄ха илля̄ ант, халякъта-нӣ ва ана̄ ‘абдука, ва ана̄ ‘аля̄ ‘ахдика ва ва‘дика ма-стата‘ту, а‘ӯзу бика мин шарри ма̄ сана‘ту, абӯ’у ляка би-ни‘матика ‘аляйя, ва абӯ’у ляка би-занбӣ, фа-гфир лӣ, фа-иннаху ля̄ ягфиру-з-зунӯба илля̄ ант.»",
      translation:
        "«О Аллах! Ты — Господь мой, и нет бога, кроме Тебя; Ты создал меня, а я — Твой раб, и я буду хранить верность Тебе, пока у меня хватит сил. Прибегаю к Твоей защите от зла того, что я сделал, признаю милость, оказанную Тобой мне, и признаю грех свой, прости же меня, ибо, поистине, никто не прощает грехов, кроме Тебя».",
    },
    {
      id: 11,
      arabic:
        "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
      transliteration:
        "«Алла́хумма иннӣ залямту нафсӣ зульман кясӣран, ва ля̄ ягфиру-з-зунӯба илля̄ ант, фа-гфир лӣ магфиратан мин ‘индика, вархамнӣ, иннака анта-ль-Гафӯру-р-Рахӣм.»",
      translation:
        "«О, Аллах! Я совершил грехи, а никто, кроме Тебя не прощает грехов. Прости же меня и даруй мне Свое прощение и помилуй меня, поистине, Ты – Прощающий, Милосердный».",
    },

    {
      id: 12,
      arabic:
        "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلَانِيَتَهُ وَسِرَّهُ",
      transliteration:
        "«Алла́хумма-гфир ли́ занби́ куллаху, диккаху ва джиллаху, ва авваляху ва а̄хыраху, ва ‘аля̄нийятаху ва сирраху».",
      translation:
        "«О Аллах, прости мне все мои грехи: малые и большие, первые и последние, явные и скрытые».",
    },
    {
      id: 13,
      arabic:
        "اللَّهُمَّ طَهِّرْنِي بِالثَّلْجِ وَالْبَرَدِ وَالْمَاءِ الْبَارِدِ، اللَّهُمَّ طَهِّرْنِي مِنَ الذُّنُوبِ وَالْخَطَايَا، كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنَ الْوَسَخِ",
      transliteration:
        "«Алла́хумма таххирни́ бис-сальджи валь-баради валь-ма̄’иль-ба̄риди, Алла́хумма таххирни́ мина-з-зуну́би валь-хата̄йа̄, кама̄ юнакка-с-саўбу-ль-абйаду миналь-васахи».",
      translation:
        "«О Аллах, очисти меня снегом, градом и прохладной водой. О Аллах, очисти меня от грехов и прегрешений, как очищают белую одежду от грязи».",
    },
    {
      id: 14,
      arabic:
        "رَبِّ اغْفِرْ لِي، وَتُبْ عَلَيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ",
      transliteration:
        "«Рабби-гфир ли́, ва туб ‘аляйя, иннака анта-т-Тавва̄бу-р-Рахи́м».",
      translation:
        "«Господь мой, прости меня и прими моё покаяние. Поистине, Ты — Принимающий покаяние, Милосердный».",
    },
    {
      id: 15,
      arabic:
        "اللَّهُمَّ اغْفِرْ لِحَيِّنَا، وَمَيِّتِنَا، وَصَغِيرِنَا وَكَبِيرِنَا، وَذَكَرِنَا وَأُنْثَانَا، وَشَاهِدِنَا وَغَائِبِنَا، اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الْإِيمَانِ، وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الْإِسْلَامِ",
      transliteration:
        "«Алла́хумма-гфир ли-хаййина́ ва маййитина́, ва сагыйрина́ ва кабийрина́, ва закарина́ ва унса́на, ва ша̄хидина́ ва га̄ибина́. Алла́хумма ман ахйайтаху́ минна́ фа-ахйихи́ ‘аля-ль-има́ни, ва ман таваффайтаху́ минна́ фа-таваффаху́ ‘аля-ль-исля́м(и).»",
      translation:
        "«О Аллах, прости нашим живым и мёртвым, малым и старым, мужчинам и женщинам, присутствующим и отсутствующим. О Аллах, кого из нас Ты оставляешь в живых, тому помоги жить с верой, а кого из нас Ты упокоиваешь, того упокой в Исламе.»",
    },
    {
      id: 16,
      arabic:
        "اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَخَطَايَايَ، اللَّهُمَّ أَنْعِشْنِي، وَاجْبُرْنِي، وَاهْدِنِي لِصَالِحِ الْأَعْمَالِ وَالْأَخْلَاقِ، فَإِنَّهُ لَا يَهْدِي لِصَالِحِهَا وَلَا يَصْرِفُ سَيِّئَهَا إِلَّا أَنْتَ",
      transliteration:
        "«Алла́хумма-гфир ли́ зунуби́ ва хатая́йя. Алла́хумма ан‘ишни́, ваджбурни́ ваһдини́ ли-салихиль-а‘ма́ли валь-ахля́ки, фа-иннаху ля́ яһди ли-салихиха́ ва ля́ ясрифу саййи’аха́ илля́ ант.»",
      translation:
        "«О Аллах, прости мне все мои грехи и прегрешения. О Аллах, подкрепи меня, помоги мне и укажи мне путь к благим делам и нравственным качествам, ибо, поистине, никто не укажет путь к ним и не отвратит от дурных дел и нравов, кроме Тебя.»",
    },
    {
      id: 17,
      arabic:
        "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي، وَأَخْسِئْ شَيْطَانِي، وَفُكَّ رِهَانِي",
      transliteration:
        "«Алла́хумма-гфир ли́ занби́, ва ахси’ шайта́ни, ва фукка риха́ни.»",
      translation:
        "«О Аллах, прости мой грех, прогони моего шайтана и освободи меня от его оков.»",
    },
    {
      id: 18,
      arabic:
        "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ",
      transliteration:
        "«Алла́хумма инна́ на‘у́зу бика мин ан нушрика бика шай’ан на‘лямуху, ва настагфирука лима́ ля́ на‘лямух(у).»",
      translation:
        "«О Аллах, поистине, мы ищем у Тебя защиты от того, чтобы сознательно придавать Тебе сотоварищей, и просим у Тебя прощения за то, что нам неизвестно».",
    },
    {
      id: 19,
      arabic:
        "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَعَافِنِي، وَارْزُقْنِي، وَارْفَعْنِي",
      transliteration:
        "«Алла́хумма-гфир ли́, вархамни́, ваһдини́, ва ‘а̄фини́, варзукни́, варфа‘ни́.»",
      translation:
        "«О Аллах, прости меня, помилуй меня, наставь меня, даруй мне здоровье, надели меня уделом и возвысь меня.»",
    },
  ],
};

export const chapterThree: Chapter = {
  id: "dua-guidance-steadfastness",
  title: "ИСПРАШИВАНИЕ У АЛЛАХА НАСТАВЛЕНИЯ И СТОЙКОСТИ",
  duas: [
    {
      id: 1,
      arabic: "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى، وَالتُّقَى، وَالْعَفَافَ، وَالْغِنَى",
      transliteration:
        "«Алла́хумма инни́ ас’алюка-ль-худа́, ват-тука́, валь-‘афа́фа, валь-гина́».",
      translation:
        "«О Аллах, поистине, я прошу у Тебя наставления на прямой путь, богобоязненности, целомудрия и достатка».",
    },
    {
      id: 2,
      arabic: "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالسَّدَادَ",
      transliteration:
        "«Алла́хумма инни́ ас’алюка-ль-худа́ вас-сада́д».",
      translation:
        "«О Аллах, поистине, я прошу у Тебя наставления на прямой путь и правильности во всём».",
    },
    {
      id: 3,
      arabic:
        "اللَّهُمَّ اسْتَهْدِكَ لِأَرْشَدِ أَمْرِي، وَأَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي",
      transliteration:
        "«Алла́хумма астахдика ли-аршади амри́, ва а‘у́зу бика мин шарри нафси́».",
      translation:
        "«О Аллах, я прошу Тебя направить меня к наиболее правильному в моих делах и прибегаю к Твоей защите от зла моей души».",
    },
    {
      id: 4,
      arabic:
        "اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ، وَعَافِنِي فِيمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ، إِنَّكَ تَقْضِي، وَلَا يُقْضَى عَلَيْكَ، وَإِنَّهُ لَا يَذِلُّ مَنْ وَالَيْتَ، وَلَا يَعِزُّ مَنْ عَادَيْتَ، تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ",
      transliteration:
        "«Алла́хумма-һдини́ фи́ман һадайт, ва ‘а́фини́ фи́ман ‘а́файт, ва тавалляни́ фи́ман таваллайт, ва ба́рик ли́ фи́ма а‘тайт, ва кыни́ шарра ма́ кадайт, иннака такды́ ва ля́ юкда́ ‘аляйк, ва иннаху ля́ язиллю ман ва́лайт, ва ля́ я‘иззу ман ‘а́дайт, таба́ракта раббана́ ва та‘а́лайт».",
      translation:
        "«О Аллах, веди меня прямым путём среди тех, кого Ты наставил, даруй мне благополучие среди тех, кому Ты даровал его, опекай меня среди тех, кого Ты взял под Свою опеку, благослови для меня то, что Ты мне даровал, и защити меня от зла того, что Ты предопределил. Поистине, Ты выносишь решение, и никто не выносит решения против Тебя. Не будет унижен тот, кого Ты поддержал, и не будет возвеличен тот, с кем Ты враждуешь. Благословен Ты, Господь наш, и превыше всего Ты».",
    },
    {
      id: 5,
      arabic:
        "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا، وَفِي بَصَرِي نُورًا، وَفِي سَمْعِي نُورًا، وَعَنْ يَمِينِي نُورًا، وَعَنْ يَسَارِي نُورًا، وَفَوْقِي نُورًا، وَتَحْتِي نُورًا، وَأَمَامِي نُورًا، وَخَلْفِي نُورًا، وَاجْعَلْ لِي نُورًا",
      transliteration:
        "«Алла́хумма-дж‘аль фи́ кальби́ ну́ран, ва фи́ басари́ ну́ран, ва фи́ сам‘и́ ну́ран, ва ‘ан йами́ни́ ну́ран, ва ‘ан йаса́ри́ ну́ран, ва фавкы́ ну́ран, ва тахти́ ну́ран, ва ама́ми́ ну́ран, ва халфи́ ну́ран, вадж‘аль ли́ ну́ран».",
      translation:
        "«О Аллах, помести в сердце моё свет, и в зрение моё свет, и в слух мой свет, и справа от меня свет, и слева от меня свет, и над мной свет, и подо мной свет, и впереди меня свет, и позади меня свет, и даруй мне свет».",
    },
    {
      id: 6,
      arabic:
        "رَبَّنَا آتِنَا مِنْ لَدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا",
      transliteration:
        "«Раббана́ а́тина́ мин ладунка рахматан ва хаййи’ ляна́ мин амрина́ рашада́н».",
      translation:
        "«Господь наш, даруй нам от Себя милость и устрой для нас в нашем деле правильный путь».",
    },
    {
      id: 7,
      arabic:
        "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً ۚ إِنَّكَ أَنْتَ الْوَهَّابُ",
      transliteration:
        "«Раббана́ ля́тузигъ кулю́бана́ ба‘да из хадайтана́ ва хаб ляна́ мин ладунка рахматан, иннака Анта-ль-Вахха́б».",
      translation:
        "«Господь наш, не отклоняй наши сердца после того, как Ты наставил нас, и даруй нам от Себя милость. Поистине, Ты — Дарующий».",
    },
    {
      id: 8,
      arabic:
        "يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِي عَلَىٰ دِينِكَ، اللَّهُمَّ مُصَرِّفَ الْقُلُوبِ صَرِّفْ قُلُوبَنَا عَلَىٰ طَاعَتِكَ",
      transliteration:
        "«Йа́ Мукаллиба-ль-кулю́б, саббит кальби́ ‘аля́ ди́ник. Алла́хумма Мусаррифа-ль-кулю́б, сарриф кулю́бана́ ‘аля́ та́‘атик».",
      translation:
        "«О Переворачивающий сердца, укрепи моё сердце в Твоей религии. О Аллах, Направляющий сердца, направь наши сердца к повиновению Тебе».",
    },
    {
      id: 9,
      arabic:
        "اللَّهُمَّ لَكَ أَسْلَمْتُ، وَبِكَ آمَنْتُ، وَعَلَيْكَ تَوَكَّلْتُ، وَإِلَيْكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ، اللَّهُمَّ إِنِّي أَعُوذُ بِعِزَّتِكَ، لَا إِلَٰهَ إِلَّا أَنْتَ، أَنْ تُضِلَّنِي، أَنْتَ الْحَيُّ الَّذِي لَا يَمُوتُ، وَالْجِنُّ وَالْإِنْسُ يَمُوتُونَ",
      transliteration:
        "«Алла́хумма ляка аслямту, ва бика а́манту, ва ‘аляйка таваккальту, ва иляйка анабту, ва бика ха́самту. Алла́хумма инни́ а‘у́зу би‘иззатик, ля́ иля́ха илля́ Ант, ан тудылляни́. Анта-ль-Хаййу-ллязи́ ля́ яму́ту, валь-джинну валь-инсу яму́ту́н».",
      translation:
        "«О Аллах, Тебе я предался, в Тебя уверовал, на Тебя уповаю, к Тебе обращаюсь и ради Тебя веду спор. О Аллах, поистине, я прибегаю к Твоему могуществу — нет божества, кроме Тебя — от того, чтобы Ты дал мне сбиться с пути. Ты — Живой, Который не умирает, а джинны и люди умирают».",
    },
    {
      id: 10,
      arabic:
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ الثَّبَاتَ فِي الْأَمْرِ، وَالْعَزِيمَةَ عَلَى الرُّشْدِ، وَأَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ، وَعَزَائِمَ مَغْفِرَتِكَ، وَأَسْأَلُكَ شُكْرَ نِعْمَتِكَ، وَحُسْنَ عِبَادَتِكَ، وَأَسْأَلُكَ قَلْبًا سَلِيمًا، وَلِسَانًا صَادِقًا، وَأَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا تَعْلَمُ، إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ",
      transliteration:
        "«Алла́хумма инни́ ас’алюка-с-саба́та филь-амри, валь-‘ази́мата ‘аля-р-рушди, ва ас’алюка му́джиба́ти рахматик, ва ‘аза́има магфиратик, ва ас’алюка шукра ни‘матик, ва хусна ‘иба́датик, ва ас’алюка кальбан сали́ман, ва лиса́нан са́дикан, ва ас’алюка мин хайри ма́ та‘лям, ва а‘у́зу бика мин шарри ма́ та‘лям, ва астагфирука лима́ та‘лям, иннака Анта ‘Алля́му-ль-гуйу́б».",
      translation:
        "«О Аллах, поистине, я прошу у Тебя стойкости в этом деле и решимости следовать прямым путём. Прошу у Тебя того, что влечёт за собой Твою милость, и того, что приводит к Твоему прощению. Прошу у Тебя благодарности за Твои милости и наилучшего поклонения Тебе. Прошу у Тебя здорового сердца и правдивого языка. Прошу у Тебя из того блага, которое Ты знаешь, и прибегаю к Тебе от зла того, которое Ты знаешь, и прошу у Тебя прощения за то, что Ты знаешь. Поистине, Ты — Знающий сокровенное».",
    },
    {
      id: 11,
      arabic:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَضِلَّ أَوْ أُضَلَّ، أَوْ أَزِلَّ أَوْ أُزَلَّ، أَوْ أَظْلِمَ أَوْ أُظْلَمَ، أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَيَّ",
      transliteration:
        "«Алла́хумма инни́ а‘у́зу бика ан адылля ау удалля, ау азилля ау узалля, ау азлима ау узляма, ау аджхаля ау юджхаля ‘аляйя».",
      translation:
        "«О Аллах, поистине, я прибегаю к Тебе от того, чтобы самому сбиться с пути или быть введённым в заблуждение, ошибиться самому или быть ввергнутым в ошибку, поступить несправедливо самому или подвергнуться несправедливости, проявить невежество самому или стать жертвой невежества по отношению ко мне».",
    },
  ],
};

export const chapterFour: Chapter = {
  id: "dua-good-this-world-hereafter",
  title: "ИСПРАШИВАНИЕ У АЛЛАХА БЛАГА В ОБОИХ МИРАХ",
  duas: [
    {
      id: 1,
      arabic:
        "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
      transliteration:
        "«Раббана́ а́тина́ фи-д-дунья́ хасанатан ва фи-ль-а́хирати хасанатан ва кына́ ‘аза́ба-н-на́р».",
      translation:
        "«Господь наш, даруй нам добро в этом мире и добро в Последней жизни и защити нас от мучений Огня».",
    },
    {
      id: 2,
      arabic:
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ بِهِ عَبْدُكَ وَنَبِيُّكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَعُوذُ بِكَ مِنَ النَّارِ، وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْرًا",
      transliteration:
        "«Алла́хумма инни́ ас’алюка мина-ль-хайри куллихи, ‘а́джилихи ва а̄джилихи, ма́ ‘алимту минху ва ма́ лям а‘лям. Ва а‘у́зу бика мина-ш-шарри куллихи, ‘а́джилихи ва а̄джилихи, ма́ ‘алимту минху ва ма́ лям а‘лям. Алла́хумма инни́ ас’алюка мин хайри ма́ са’аляка ‘абдука ва набийюка, ва а‘у́зу бика мин шарри ма́ ‘а̄за биһи ‘абдука ва набийюка. Алла́хумма инни́ ас’алюка-ль-джанната ва ма́ карраба илайһа мин кавлин ау ‘амалин, ва а‘у́зу бика мина-н-на́ри ва ма́ карраба илайһа мин кавлин ау ‘амалин, ва ас’алюка ан тадж‘аля кулля када̄’ин кадайтаху ли хайран».",
      translation:
        "«О Аллах, поистине, я прошу у Тебя всякого блага — скорого и отдалённого, того, что мне известно, и того, чего я не знаю. И прибегаю к Твоей защите от всякого зла — скорого и отдалённого, того, что мне известно, и того, чего я не знаю. О Аллах, поистине, я прошу у Тебя того блага, о котором просил Тебя Твой раб и Твой пророк, и прибегаю к Тебе от зла того, от которого прибегал к Тебе Твой раб и Твой пророк. О Аллах, поистине, я прошу у Тебя Рая и всего, что приближает к нему из слов и дел, и прибегаю к Тебе от Огня и всего, что приближает к нему из слов и дел. И прошу Тебя сделать всякое решение, которое Ты предопределил для меня, благим».",
    },
    {
      id: 3,
      arabic:
        "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي، وَوَسِّعْ لِي فِي دَارِي، وَبَارِكْ لِي فِيمَا رَزَقْتَنِي",
      transliteration:
        "«Алла́хумма-гфир ли́ занби́, ва васси‘ ли́ фи́ да́ри, ва ба́рик ли́ фи́ма разактани́».",
      translation:
        "«О Аллах, прости мне мой грех, сделай мой дом просторным и благослови то, чем Ты наделил меня».",
    },
    {
      id: 4,
      arabic:
        "اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي وَعَلِّمْنِي مَا يَنْفَعُنِي وَزِدْنِي عِلْمًا",
      transliteration:
        "«Алла́хумма-нфа‘ни́ бима́ ‘алламтани́ ва ‘аллимни́ ма́ янфа‘уни́ ва зидни́ ‘ильман».",
      translation:
        "«О Аллах, сделай полезным для меня то, чему Ты меня научил, научи меня тому, что принесёт мне пользу, и прибавь мне знания».",
    },
    {
      id: 5,
      arabic:
        "اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا يَحُولُ بَيْنَنَا وَبَيْنَ مَعَاصِيكَ، وَمِنْ طَاعَتِكَ مَا تُبَلِّغُنَا بِهِ جَنَّتَكَ، وَمِنَ الْيَقِينِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مُصِيبَاتِ الدُّنْيَا، وَمَتِّعْنَا بِأَسْمَاعِنَا وَأَبْصَارِنَا وَقُوَّتِنَا مَا أَحْيَيْتَنَا، وَاجْعَلْهُ الْوَارِثَ مِنَّا، وَاجْعَلْ ثَأْرَنَا عَلَىٰ مَنْ ظَلَمَنَا، وَانْصُرْنَا عَلَىٰ مَنْ عَادَانَا، وَلَا تَجْعَلْ مُصِيبَتَنَا فِي دِينِنَا، وَلَا تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا وَلَا مَبْلَغَ عِلْمِنَا، وَلَا تُسَلِّطْ عَلَيْنَا مَنْ لَا يَرْحَمُنَا",
      transliteration:
        "«Алла́хумма-ксим ляна́ мин хашйатика ма́ яху́лу байнана́ ва байна ма‘а́сыйка, ва мин та́‘атика ма́ тубаллигуна́ бихи джаннатака, ва мина-ль-якы́ни ма́ тухаввину бихи ‘аляйна́ мусы́бати-д-дунья́, ва матти‘на́ би-асма́‘ина́ ва абса́рина́ ва кувватина́ ма́ ахйайтана́, вадж‘альху-ль-ва́риса минна́, вадж‘аль са’рана́ ‘аля́ ман залямана́, вансурна́ ‘аля́ ман ‘ада́на́, ва ля́ тадж‘аль мусы́батана́ фи́ ди́нина́, ва ля́ тадж‘али-д-дунья́ акбара хаммина́ ва ля́ мабляга ‘ильмина́, ва ля́ тусаллит ‘аляйна́ ман ля́ ярхамуна́».",
      translation:
        "«О Аллах, даруй нам такой страх перед Тобой, который удержит нас от ослушания Тебя, и такое повиновение Тебе, которое доведёт нас до Твоего Рая, и такую убеждённость, которая облегчит для нас беды этого мира. О Аллах, дай нам пользоваться нашим слухом, зрением и силой, пока Ты даруешь нам жизнь, и сделай это наследуемым для нас. Даруй нам отмщение тем, кто поступил с нами несправедливо, помоги нам против тех, кто враждует с нами, не делай нашу религию предметом нашего бедствия, не делай мир этот нашей величайшей заботой и пределом нашего знания и не ставь над нами тех, кто не проявит к нам милости».",
    },
    {
      id: 6,
      arabic:
        "اللَّهُمَّ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنْتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ",
      transliteration:
        "«Алла́хумма, Фа́тыра-с-самава́ти валь-арди, Анта валиййи́ фи-д-дунья́ валь-а́хирати, таваффани́ муслиман ва альхикни́ би-с-са́лихи́н».",
      translation:
        "«О Аллах, Творец небес и земли, Ты — мой Покровитель в этом мире и в Последней жизни. Умертви меня мусульманином и присоедини меня к праведникам».",
    },
    {
      id: 7,
      arabic:
        "اللَّهُمَّ أَعِنِّي عَلَى شُكْرِكَ، وَذِكْرِكَ، وَحُسْنِ عِبَادَتِكَ",
      transliteration:
        "«Алла́хумма а‘инни́ ‘аля́ шукрика, ва зикрика, ва хусни ‘иба́датик».",
      translation:
        "«О Аллах, помоги мне поминать Тебя, благодарить Тебя и поклоняться Тебе наилучшим образом».",
    },
    {
      id: 8,
      arabic: "اللَّهُمَّ أَحْسَنْتَ خَلْقِي فَأَحْسِنْ خُلُقِي",
      transliteration:
        "«Алла́хумма ахсанта хальки́ фа-ахсин хулуки́».",
      translation:
        "«О Аллах, Ты сделал прекрасным мой облик, так сделай прекрасным и мой нрав».",
    },
    {
      id: 9,
      arabic:
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَرَحْمَتِكَ، فَإِنَّهُ لَا يَمْلِكُهَا إِلَّا أَنْتَ",
      transliteration:
        "«Алла́хумма инни́ ас’алюка мин фадлика ва рахматика, фа-иннаху ля́ ямликуха́ илля́ Ант».",
      translation:
        "«О Аллах, поистине, я прошу у Тебя Твоей щедрости и милости, ибо никто, кроме Тебя, не владеет ими».",
    },
    {
      id: 10,
      arabic: "رَبِّ اشْرَحْ لِي صَدْرِي ۝ وَيَسِّرْ لِي أَمْرِي",
      transliteration:
        "«Рабби-шрах ли́ садри́ ва йассир ли́ амри́».",
      translation:
        "«Господи, раскрой для меня мою грудь и облегчи мне моё дело».",
    },
    {
      id: 11,
      arabic:
        "رَبَّنَا آمَنَّا بِمَا أَنْزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ",
      transliteration:
        "«Раббана́ а́манна́ бима́ анзальта ва-ттаба‘на-р-расу́ля фактубна́ ма‘а-ш-ша́хиди́н».",
      translation:
        "«Господь наш, мы уверовали в то, что Ты ниспослал, и последовали за посланником. Запиши же нас в число свидетельствующих».",
    },
    {
      id: 12,
      arabic: "رَبِّ زِدْنِي عِلْمًا",
      transliteration:
        "«Рабби зидни́ ‘ильма».",
      translation:
        "«Господи, прибавь мне знания».",
    },
    {
      id: 13,
      arabic:
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ حُبَّكَ، وَحُبَّ مَنْ يُحِبُّكَ، وَحُبَّ عَمَلٍ يُقَرِّبُنِي إِلَى حُبِّكَ",
      transliteration:
        "«Алла́хумма инни́ ас’алюка хýббака, ва хýбба ман юхи́ббука, ва хýбба ‘амалин юкаррибуни́ иля́ хýббик».",
      translation:
        "«О Аллах, поистине, я прошу у Тебя любви к Тебе, любви к тем, кто любит Тебя, и любви к делам, которые приближают меня к Твоей любви».",
    },
  ],
};

export const chapterFive: Chapter = {
  id: "dua-parents-family-children",
  title: "ИСПРАШИВАНИЕ У АЛЛАХА БЛАГА ДЛЯ СЕМЬИ",
  duas: [
    {
      id: 1,
      arabic:
        "رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ",
      transliteration:
        "«Рабби-гфир ли́ ва ли-ва̄лидаййа, ва лиман дахаля байтийа му’минан, ва ли-ль-му’мини́на ва-ль-му’мина́т».",
      translation:
        "«Господи, прости меня, моих родителей и того, кто вошёл в мой дом верующим, а также верующих мужчин и верующих женщин».",
    },
    {
      id: 2,
      arabic: "رَبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا",
      transliteration:
        "«Рабби-рхамхума́ кама́ раббая́ни сагы́ра».",
      translation:
        "«Господи, помилуй их, ведь они растили меня ребёнком».",
    },
    {
      id: 3,
      arabic:
        "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
      transliteration:
        "«Раббана́ хаб лана́ мин азва̄джина́ ва зуррийя̄тина́ куррата а‘юнин, вадж‘альна́ ли-ль-муттаки́на има́ма».",
      translation:
        "«Господь наш, даруй нам отраду глаз в наших супругах и потомках и сделай нас образцом для богобоязненных».",
    },
    {
      id: 4,
      arabic:
        "رَبِّ هَبْ لِي مِنْ لَدُنْكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ الدُّعَاءِ",
      transliteration:
        "«Рабби хаб ли́ мин ладунка зуррийятан таййибатан, иннака сами́‘у-д-ду‘а̄’».",
      translation:
        "«Господи, даруй мне от Себя благое потомство. Поистине, Ты слышащий мольбу».",
    },
    {
      id: 5,
      arabic:
        "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ",
      transliteration:
        "«Рабби-дж‘альни́ муки́ма-с-саля́ти ва мин зуррийяти́, Раббана́ ва такабба́ль ду‘а̄’».",
      translation:
        "«Господи, сделай меня совершающим молитву, и из моего потомства тоже. Господь наш, прими мою мольбу».",
    },
    {
      id: 6,
      arabic:
        "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي ۖ إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ",
      transliteration:
        "«Рабби аузи‘ни́ ан ашкура ни‘матака-лляти́ ан‘амта ‘аляйя ва ‘аля́ ва̄лидаййа, ва ан а‘мала са̄лихан тарда̄ху, ва аслих ли́ фи́ зуррийяти́, инни́ тубту иляйка ва инни́ мина-ль-муслими́н».",
      translation:
        "«Господи, внуши мне быть благодарным за Твою милость, которой Ты облагодетельствовал меня и моих родителей, и помоги мне совершать праведные дела, которыми Ты доволен. Сделай праведными для меня моих потомков. Поистине, я раскаялся перед Тобой, и, поистине, я — из числа мусульман».",
    },
  ],
};

export const chapterSix: Chapter = {
  id: "dua-religion-hereafter",
  title: "ИСПРАШИВАНИЕ У АЛЛАХА БЛАГА РЕЛИГИИ И АХИРАТА",
  duas: [
    {
      id: 1,
      arabic:
        "اللَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ",
      transliteration:
        "«Алла́хумма аслих ли́ ди́ни-ль-лязи́ хува ‘исмату амри́, ва аслих ли́ дунья́йя-ль-ляти́ фи́ха ма‘а́ши́, ва аслих ли́ а́хирати-ль-ляти́ фи́ха ма‘а́ди́, вадж‘али-ль-хайа́та зия́датан ли́ фи́ кулли хайрин, вадж‘али-ль-маута ра́хатан ли́ мин кулли шаррин».",
      translation:
        "«О Аллах, приведи в порядок мою религию, которая является защитой моего дела; приведи в порядок мою мирскую жизнь, в которой мое существование; приведи в порядок мою Последнюю жизнь, к которой мое возвращение; сделай жизнь для меня приумножением всякого блага, а смерть — покоем для меня от всякого зла».",
    },
    {
      id: 2,
      arabic:
        "اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ، وَقُدْرَتِكَ عَلَى الْخَلْقِ، أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِي",
      transliteration:
        "«Алла́хумма би‘ильмика-ль-гайба, ва кудратика ‘аля-ль-хальки, ахйини́ ма́ ‘алимта-ль-хайа́та хайран ли́, ва таваффани́ иза́ ‘алимта-ль-вафа́та хайран ли́».",
      translation:
        "«О Аллах, ради Твоего знания о сокровенном и Твоей способности творить, продли мою жизнь, если Ты знаешь, что жизнь будет для меня лучше, и упокой меня, если Ты знаешь, что смерть будет для меня лучше».",
    },
    {
      id: 3,
      arabic:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ ضِيقِ الدُّنْيَا وَضِيقِ يَوْمِ الْقِيَامَةِ",
      transliteration:
        "«Алла́хумма инни́ а‘у́зу бика мин дыйки-д-дунья́ ва дыйки йауми-ль-кыя́ма».",
      translation:
        "«О Аллах, поистине, я прибегаю к Твоей защите от тягот этого мира и от тягот Дня воскресения».",
    },
    {
      id: 4,
      arabic:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ قَلْبٍ لَا يَخْشَعُ، وَمِنْ دُعَاءٍ لَا يُسْمَعُ، وَمِنْ نَفْسٍ لَا تَشْبَعُ، وَمِنْ عِلْمٍ لَا يَنْفَعُ، أَعُوذُ بِكَ مِنْ هَؤُلَاءِ الْأَرْبَعِ",
      transliteration:
        "«Алла́хумма инни́ а‘у́зу бика мин кальбин ля́ яхша‘у, ва мин ду‘а̄’ин ля́ юсма‘у, ва мин нафсин ля́ ташба‘у, ва мин ‘ильмин ля́ янфа‘у, а‘у́зу бика мин hā’уля̄’и-ль-арба‘».",
      translation:
        "«О Аллах, поистине, я прибегаю к Твоей защите от сердца, не проявляющего смирения, от мольбы, которая не будет услышана, от души, которая не насыщается, и от знания, которое не приносит пользы. Я прибегаю к Твоей защите от этих четырёх вещей».",
    },
    {
      id: 5,
      arabic:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ",
      transliteration:
        "«Алла́хумма инни́ а‘у́зу бика мин шарри ма́ ‘амильту ва мин шарри ма́ лям а‘маль».",
      translation:
        "«О Аллах, поистине, я прибегаю к Твоей защите от зла того, что я совершил, и от зла того, чего я не совершил».",
    },
    {
      id: 6,
      arabic: "اللَّهُمَّ لَا تُخْزِنِي يَوْمَ الْقِيَامَةِ",
      transliteration:
        "«Алла́хумма ля́ тухзини́ йаума-ль-кыя́ма».",
      translation:
        "«О Аллах, не опозорь меня в День воскресения».",
    },
    {
      id: 7,
      arabic: "اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ",
      transliteration:
        "«Алла́хумма-фтах ли́ абва́ба рахматик».",
      translation:
        "«О Аллах, открой мне врата Твоей милости».",
    },
    // Изменено: добавлены дуа 60-100 из PDF | Зачем: завершить коллекцию до 100 дуа
    {
      id: 8,
      arabic: "اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ",
      transliteration:
        "«Алла́хумма-дж'ални мина-т-таввабина ва-дж'альни мина-ль-мутатаhhири́н(а)».",
      translation:
        "«О Аллах! Сделай меня одним из кающихся и сделай меня одним из очищающихся».",
    },
    {
      id: 9,
      arabic:
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْفَقْرِ وَالْغِنَى، وَأَسْأَلُكَ نَعِيمًا لَا يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعُ، وَأَسْأَلُكَ الرِّضَاءَ بَعْدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلَا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيِّنَّا بِزِينَةِ الْإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ",
      transliteration:
        "«Алла́хумма инни́ ас'алюка хаш'ятака фи-ль-гайби ва-ш-шаха́дати, ва ас'алюка калимата-ль-хакки фи-р-рида́ ва-ль-гадаби, ва ас'алюка-ль-касда фи-ль-факри ва-ль-гина, ва ас'алюка на'иман ля янфаду, ва ас'алюка куррата 'айнин ля танкати'у, ва ас'алюка-р-рида́'а ба'да-ль-када́, ва ас'алюка барда-ль-'айши ба'да-ль-мавти, ва ас'алюка ляззата-н-назари иля ваджхика ва-ш-шавка иля лика́'ика фи гайри дарра́'а мудзирратин, ва ля фитнатин мудзиллятин. Алла́хумма заййинна́ би-зинати-ль-и́мани, ва-дж'альна худа́тан мухтади́н(а)».",
      translation:
        "«О Аллах! Я прошу Тебя внушить мне страх перед Тобой в сокровенном и явном, и прошу Тебя помочь мне говорить правдивое и справедливое слово в гневе и довольстве. Я прошу Тебя об умеренности в нужде и богатстве, и прошу Тебя о блаженстве, которое не закончится, и прошу Тебя об усладе для глаз, которая не прервётся, и прошу Тебя помочь мне быть довольным судьбой. Я прошу Тебя о прохладной жизни после смерти, и прошу Тебя позволить мне насладиться взором на Твой лик, и прошу Тебя помочь мне стремиться к встрече с Тобой, чтобы не помешало этому ни несчастье, которое причиняет вред, ни искушение, которое сбивает с пути. О Аллах! Укрась нас верой и сделай нас наставниками, следующими прямым путём».",
    },
    {
      id: 10,
      arabic:
        "اللَّهُمَّ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، لَا إِلَهَ إِلَّا أَنْتَ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءًا أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
      transliteration:
        "«Алла́хумма Фатира-с-сама́вати ва-ль-ардзи, 'алима-ль-гайби ва-ш-шаха́дати, ля иляха илля Анта, Рабба кулля шай'ин ва маликаху, а'у́зу бика мин шарри нафси, ва-ш-шайтани ва ширкихи, ва ан акта́рифа 'аля нафси су'ан ав аджуррраху иля муслим(ин)».",
      translation:
        "«О Аллах! Творец небес и земли, Знающий сокрытое и явное, свидетельствую что нет бога кроме Тебя, Господь и Владыка всего. Я прибегаю к Твоей защите от зла собственной души, от зла шайтана и его многобожия, и от того, чтобы причинить зло самому себе или навлечь его на какого-нибудь мусульманина».",
    },
    {
      id: 11,
      arabic:
        "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
      transliteration:
        "«Йа́ Хаййу, йа Кайю́му, бирахматика астагису, аслих ли ша'ни куллях, ва ля такильни иля нафси тарфата 'айн(ин)».",
      translation:
        "«О Живой, о Вечносущий! Обращаюсь за защитой к милосердию Твоему, приведи в порядок все мои дела и не доверяй меня душе моей ни на мгновение».",
    },
    {
      id: 12,
      arabic:
        "اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
      transliteration:
        "«Алла́хумма-кфини бихалялика ан харамика, ва агнини бифадзлика 'амман сива́к(а)».",
      translation:
        "«О Аллах! Избавь меня через дозволенное от запретного и сделай по Своей милости так, чтобы я не нуждался ни в ком, кроме Тебя».",
    },
    {
      id: 13,
      arabic:
        "اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي",
      transliteration:
        "«Алла́хумма инни́ 'абдука, ибну 'абдика, ибну аматика, насийати бийадика, мадзин фиййа хукмука, 'адлюн фиййа кадза'ука, ас'алюка бикулли исмин хува ляка саммайта бихи нафсака, ав 'аллямтаху ахадан мин халкика, ав анзальтаху фи китабика, ав иста'сарта бихи фи 'ильми-ль-гайби 'индака, ан тадж'аля-ль-Кур'ана раби'а кальби, ва нура садри, ва джаля'а хузни, ва зихаба хамми́».",
      translation:
        "«О Аллах! Поистине я – раб Твой, и сын раба Твоего и сын рабыни Твоей. Ты подвластен Тебе, решения Твои обязательны для меня, а приговор, вынесенный Тобой мне, справедлив. Я заклинаю Тебя каждым из Твоих имен, которым Ты назвал Себя Сам, или ниспослал его в Книге Твоей, или открыл его кому-либо из сотворенных Тобой, или оставил его скрытым от всех, кроме Тебя, — сделать Коран весной моего сердца, светом моей груди и причиной исчезновения моей грусти и прекращения моего беспокойства».",
    },
    {
      id: 14,
      arabic:
        "اللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَرَبَّ الْأَرْضِ وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنَزِّلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ، اللَّهُمَّ أَنْتَ الْأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الْآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ، وَأَغْنِنَا مِنَ الْفَقْرِ",
      transliteration:
        "«Алла́хумма Рабба-с-сама́вати-с-саб'и ва Рабба-ль-ардзи ва Рабба-ль-'арши-ль-'азы́м(и). Раббана́ ва Рабба кулли шай'ин, фалика-ль-хабби ва-н-нава, ва мунзила-т-Таврати ва-ль-Инджили ва-ль-Фуркани, а'у́зу бика мин шарри кулли шай'ин анта ахизун бинасийатихи. Алла́хумма Анта-ль-Авва́лю, фалайса каблика шай'ун, ва Анта-ль-А́хиру, фалайса ба'дака шай'ун, ва Анта-з-За́хиру, фалайса фавкака шай'ун, ва Анта-ль-Батыну, фалайса дунака шай'ун. Икдзи 'анна-д-дайна, ва агнина мина-ль-факр(и)».",
      translation:
        "«О Аллах! Господь семи небес и Господь великого трона, Господь наш и Господь всего, Расщепляющий зерна и ядра, Ниспославший Тору, Евангелие и Различение, прибегаю к Тебе от зла всякой вещи, ибо всё подвластно Тебе. О Аллах! Ты — Первый, и не было ничего до Тебя, Ты — Последний, и не будет ничего после Тебя, Ты — Победивший, и нет ничего над Тобой, и Ты — Скрытый, и нет ничего под Тобой, избавь нас от долгов наших и избавь нас от бедности».",
    },
    {
      id: 15,
      arabic:
        "اللَّهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلًا، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذَا شِئْتَ سَهْلًا",
      transliteration:
        "«Алла́хумма ля сахля илля ма дж'альтаху сахлян, ва Анта тадж'алю-ль-хазна иза ши'та сахла́(н)».",
      translation:
        "«О Аллах! Нет ничего лёгкого, кроме того, что Ты сделал лёгким, и если Ты пожелаешь, то сделаешь это затруднение лёгким».",
    },
    {
      id: 16,
      arabic:
        "اللَّهُمَّ رَحْمَتَكَ أَرْجُو، فَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لَا إِلَهَ إِلَّا أَنْتَ",
      transliteration:
        "«Алла́хумма рахматака арджу, фаля такильни иля нафси тарфата 'айнин, ва аслих ли ша'ни куллях, ля иляха илля Ант(а)».",
      translation:
        "«О Аллах! Я надеюсь на Твою милость. Не доверяй меня душе моей ни на мгновение и приведи в порядок все мои дела, ведь нет бога, кроме Тебя».",
    },
    {
      id: 17,
      arabic: "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ",
      transliteration: "«Алла́хумма инни́ ас'алюка мин фадзлик(а)».",
      translation: "«О Аллах! Я прошу у Тебя добавления Твоего благодеяния».",
    },
    {
      id: 18,
      arabic:
        "اللَّهُمَّ اجْعَلْ أَوْسَعَ رِزْقِكَ عَلَيَّ عِنْدَ كِبَرِ سِنِّي، وَانْقِطَاعِ عُمْرِي",
      transliteration:
        "«Алла́хумма-дж'аль авса'а ризкика 'аляйя 'инда кибари синни, ва-нкита'и 'умри».",
      translation:
        "«О Аллах! Даруй мне широкий удел при достижении старости и в завершении моей жизни».",
    },
    {
      id: 19,
      arabic: "اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي",
      transliteration:
        "«Алла́хумма иннака 'афуввун тухиббу-ль-'афва фа'фу 'анни».",
      translation:
        "«О Аллах! Поистине, ты – Прощающий, любишь прощать, так прости же меня».",
    },
    {
      id: 20,
      arabic:
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي، وَعَنْ يَمِينِي وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",
      transliteration:
        "«Алла́хумма инни́ ас'алюка-ль-'афва ва-ль-'афията фи-д-дунья ва-ль-ахира(ти). Алла́хумма инни ас'алюка-ль-'афва ва-ль-'афията фи дини ва дунйайя ва ахли ва мали. Алла́хумма-стур 'авра́ти ва амин рав'ати. Алла́хумма-хфазни мин байни йадаййа ва мин халфи, ва 'ан ямини ва 'ан шимали, ва мин фавки, ва а'у́зу бика ан угтала мин тахти».",
      translation:
        "«О Аллах! Поистине, я прошу Тебя об избавлении от недостатков в мире этом и в мире ином. О Аллах, поистине, я прошу Тебя о прощении и избавлении во всём, что касается моей религии, моих мирских дел, моей семьи и моего имущества. О Аллах! Прикрой мою наготу и огради меня от страха. О Аллах! Защити меня спереди, сзади, справа, слева и сверху, и я прибегаю к защите Твоего величия от того, чтобы быть предательски убитым снизу».",
    },
    {
      id: 21,
      arabic:
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْمُعَافَاةَ فِي الدُّنْيَا وَالْآخِرَةِ",
      transliteration:
        "«Алла́хумма инни́ ас'алюка-ль-му'афата фи-д-дунья ва-ль-ахира(ти)».",
      translation: "«О Аллах! Прошу у Тебя блага в этом мире и в мире вечном».",
    },
    {
      id: 22,
      arabic:
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ وَالْيَقِينَ فِي الْآخِرَةِ وَالْأُولَى",
      transliteration:
        "«Алла́хумма инни́ ас'алюка-ль-'афва ва-ль-'афията ва-ль-якина фи-ль-ахирати ва-ль-уля».",
      translation:
        "«О Аллах! Поистине, я прошу Тебя прощения и благополучия и уверенности в этой и потусторонней жизни».",
    },
    {
      id: 23,
      arabic:
        "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ",
      transliteration:
        "«Алла́хумма 'афини фи бадани, Алла́хумма 'афини фи сам'и, Алла́хумма 'афини фи басари, ля иляха илля Ант(а)».",
      translation:
        "«О Аллах! Исцели моё тело. О Аллах! Исцели мой слух. О Аллах! Исцели моё зрение, нет бога, кроме Тебя».",
    },
    {
      id: 24,
      arabic:
        "اللَّهُمَّ مَتِّعْنِي بِسَمْعِي وَبَصَرِي حَتَّى تَجْعَلَهُمَا الْوَارِثَ مِنِّي، وَعَافِنِي فِي دِينِي وَجَسَدِي، وَانْصُرْنِي عَلَى مَنْ ظَلَمَنِي حَتَّى تُرِيَنِي فِيهِ ثَأْرِي",
      transliteration:
        "«Алла́хумма матти'ни бисам'и ва басари хатта тадж'альхума-ль-вариса минни, ва 'афини фи дини ва джасади, ва-нсурни 'аля мимман залямуни хатта туриянй фихи са'ри».",
      translation:
        "«О Аллах! Позволь мне пользоваться моим слухом и зрением, сделай их наследниками моими, помоги мне против того, кто поступает со мной несправедливо, и отомсти ему за меня».",
    },
    {
      id: 25,
      arabic:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَالْجُبْنِ وَالْبُخْلِ وَالْهَرَمِ وَالْقَسْوَةِ، وَالْغَفْلَةِ وَالْعَيْلَةِ، وَالذِّلَّةِ وَالْمَسْكَنَةِ، وَأَعُوذُ بِكَ مِنَ الْفَقْرِ وَالْكُفْرِ وَالْفُسُوقِ وَالشِّقَاقِ، وَالنِّفَاقِ وَالسُّمْعَةِ وَالرِّيَاءِ، وَأَعُوذُ بِكَ مِنَ الصَّمَمِ وَالْبَكَمِ، وَالْجُنُونِ، وَالْجُذَامِ، وَسَيِّءِ الْأَسْقَامِ",
      transliteration:
        "«Алла́хумма инни а'у́зу бика мина-ль-'аджзи ва-ль-касали, ва-ль-джубни ва-ль-бухли, ва-ль-харами ва-ль-касвати, ва-ль-гафляти ва-ль-айляти, ва-з-зиллати ва-ль-масканати, ва а'у́зу бика мина-ль-факри ва-ль-куфри, ва-ль-фусуки ва-ш-шикаки, ва-н-нифаки ва-с-сум'ати, ва-р-рийа'и, ва а'у́зу бика мина-с-самами, ва-ль-баками, ва-ль-джунуни, ва-ль-джузами, ва сайии-ль-аскам(и)».",
      translation:
        "«О Аллах! Поистине, я прибегаю к Твоей защите от слабости, и нерадения, малодушия, скупости и старческой дряхлости, жестокости, отвлечённости рассеянности, иметь большую семью и быть при этом бедным, унижения, и чтобы быть нуждающимся. И я прибегаю к Твоей защите от нищеты, неверия, нечестия, несчастия, лицемерия, позора и показухи. И прибегаю к Твоей защите от глухоты, немоты, безумия, лепры, проказы и прочих тяжких болезней».",
    },
    {
      id: 26,
      arabic:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْجُوعِ، فَإِنَّهُ بِئْسَ الضَّجِيعُ، وَأَعُوذُ بِكَ مِنَ الْخِيَانَةِ، فَإِنَّهَا بِئْسَتِ الْبِطَانَةُ",
      transliteration:
        "«Алла́хумма инни а'у́зу бика мина-ль-джу'и, фаиннаху би'са-д-даджи'у, ва а'у́зу бика мина-ль-хийанати, фаиннаха би'сати-ль-битана(ту)».",
      translation:
        "«О Аллах! Поистине, я прибегаю к Твоей защите от голода — сколь плохо делить с ним постель — и я прибегаю к Твоей защите от вероломства — скверное это внутреннее содержание».",
    },
    {
      id: 27,
      arabic:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ، وَسُوءِ الْعُمُرِ، وَفِتْنَةِ الصَّدْرِ، وَعَذَابِ الْقَبْرِ",
      transliteration:
        "«Алла́хумма инни а'у́зу бика мина-ль-джубни ва-ль-бухли, ва су'и-ль-'умури, ва фитнати-с-садри, ва 'азаби-ль-кабр(и)».",
      translation:
        "«О Аллах! Я прибегаю к Твоей защите от малодушия и скупости, от плохой судьбы, от смуты груди и от могильных мук».",
    },
    {
      id: 28,
      arabic:
        "اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلَاهَا، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ، وَمِنْ قَلْبٍ لَا يَخْشَعُ، وَمِنْ نَفْسٍ لَا تَشْبَعُ، وَمِنْ دَعْوَةٍ لَا يُسْتَجَابُ لَهَا",
      transliteration:
        "«Алла́хумма ати нафси таква́ха, ва заккиха, Анта хайру ман заккяха, Анта валийюха ва мавляха. Алла́хумма инни а'у́зу бика мин 'ильмин ля янфа'у, ва мин кальбин ля яхша'у, ва мин нафсин ля ташба'у, ва мин да'ватин ля юстаджабу ляха».",
      translation:
        "«О Аллах! Даруй душе моей благочестие и очисти её, ведь Ты – лучший из очищающих её и Ты – её Покровитель и Владыка. О Аллах! Поистине, я прибегаю к Твоей защите от бесполезного знания, от сердца, не проявляющего смирения, и от души, которая не может насыщаться, и от мольбы, которой не внемлют».",
    },
    {
      id: 29,
      arabic:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ",
      transliteration:
        "«Алла́хумма инни а'у́зу бика мина-ль-хамми ва-ль-хазани, ва-ль-'аджзи ва-ль-касали, ва-ль-бухли ва-ль-джубни, ва дзала'и-д-дайни, ва галябати-р-риджал(и)».",
      translation:
        "«О Аллах! Поистине, я прибегаю к Твоей защите от беспокойства и грусти, от слабости и нерадения, от скупости и малодушия, от бремени долга и притеснения людей».",
    },
    {
      id: 30,
      arabic:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ، وَدَرَكِ الشَّقَاءِ، وَسُوءِ الْقَضَاءِ، وَشَمَاتَةِ الْأَعْدَاءِ",
      transliteration:
        "«Алла́хумма инни а'у́зу бика мин джахди-ль-балаи, ва дараки-ш-шакаи, ва су'и-ль-кадзаи, ва шаматати-ль-а'да(и)».",
      translation:
        "«О Аллах! Я прошу у Тебя защиты от тяжести испытания, прихода злосчастья, зла предопределения и злорадства врагов».",
    },
    {
      id: 31,
      arabic:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ يَوْمِ السَّوْءِ، وَمِنْ لَيْلَةِ السَّوْءِ، وَمِنْ سَاعَةِ السَّوْءِ، وَمِنْ صَاحِبِ السَّوْءِ، وَمِنْ جَارِ السَّوْءِ فِي دَارِ الْمُقَامَةِ",
      transliteration:
        "«Алла́хумма инни а'у́зу бика мин йавми-с-сав'и, ва мин лайляти-с-сав'и, ва мин са'ати-с-сав'и, ва мин сахиби-с-сав'и, ва мин джари-с-сав'и фи дари-ль-мукама(ти)».",
      translation:
        "«О Аллах! Поистине, я прибегаю к Твоей защите от плохого дня, плохой ночи и плохого часа, от плохого товарища и плохого соседа на месте моего проживания».",
    },
    {
      id: 32,
      arabic:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَدْمِ، وَأَعُوذُ بِكَ مِنَ التَّرَدِّي، وَأَعُوذُ بِكَ مِنَ الْغَرَقِ وَالْحَرَقِ، وَأَعُوذُ بِكَ أَنْ يَتَخَبَّطَنِي الشَّيْطَانُ عِنْدَ الْمَوْتِ، وَأَعُوذُ بِكَ أَنْ أَمُوتَ فِي سَبِيلِكَ مُدْبِرًا، وَأَعُوذُ بِكَ أَنْ أَمُوتَ لَدِيغًا",
      transliteration:
        "«Алла́хумма инни а'у́зу бика мина-ль-хадми, ва а'у́зу бика мина-т-тарадди, ва а'у́зу бика мина-ль-гараки, ва-ль-хараки, ва а'у́зу бика ан ятахаббатани-ш-шайтану 'инда-ль-мавти, ва а'у́зу бика ан амута фи сабиликя мудбиран, ва а'у́зу бика ан амута лядига(н)».",
      translation:
        "«О Аллах! Поистине, я прибегаю к Твоей защите от падения, от разрушения, от утопания и ожога, и я прибегаю к Твоей защите от того, чтобы перед смертью ко мне пробрался шайтан, и я прибегаю к Твоей защите от того, чтобы умереть на пути Твоём, отступая, и я прибегаю к Твоей защите от того, чтобы умереть, будучи ужаленным».",
    },
    {
      id: 33,
      arabic:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ",
      transliteration:
        "«Алла́хумма инни а'у́зу бика мин завали ни'матика ва тахаввули 'афиятика, ва фуджа'ати никматика, ва джами'и сахатик(а)».",
      translation:
        "«О Аллах! Поистине, я прибегаю к Твоей защите от прекращения Твоих благодеяний, и перемены в том, что касается дарованного Тобой благополучия, и внезапности Твоей кары и всего того, что может вызвать Твой гнев».",
    },
    {
      id: 34,
      arabic:
        "اللَّهُمَّ أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ لَا أُحْصِي ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
      transliteration:
        "«Алла́хумма а'у́зу биридзака мин сахатика, ва би-му'афатика мин 'укубатика, ва а'у́зу бика минка ля ухси сана'ан 'аляйка, Анта кама аснайта 'аля нафсик(а)».",
      translation:
        "«О Аллах! Поистине, я прибегаю к благоволению Твоему от негодования Твоего и к прощению Твоему от наказания Твоего, и я прибегаю к Тебе от Тебя. Не сосчитать мне всех похвал которых Ты достоин, ибо лишь Ты Сам воздал их Себе в достаточной мере».",
    },
    {
      id: 35,
      arabic:
        "اللَّهُمَّ جَنِّبْنِي مُنْكَرَاتِ الْأَخْلَاقِ، وَالْأَهْوَاءِ، وَالْأَعْمَالِ، وَالْأَدْوَاءِ",
      transliteration:
        "«Алла́хумма джаннибни мункарати-ль-ахляки, ва-ль-ахва'и, ва-ль-а'мали, ва-ль-адва(и)».",
      translation:
        "«О Аллах! Поистине, я прибегаю к Твоей защите от мерзких нравственных качеств и дел, от скверных желаний и недугов».",
    },
    {
      id: 36,
      arabic:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ سَمْعِي وَمِنْ شَرِّ بَصَرِي وَمِنْ شَرِّ لِسَانِي وَمِنْ شَرِّ قَلْبِي وَمِنْ شَرِّ مَنِيِّي",
      transliteration:
        "«Алла́хумма инни а'у́зу бика мин шарри сам'и, ва мин шарри басари, ва мин шарри лисани, ва мин шарри кальби, ва мин шарри маниййи».",
      translation:
        "«О Аллах! Поистине, я прибегаю к Твоей защите от зла моего слуха, и от зла моего зрения, и от зла моего языка, и от зла моего сердца, и от зла моих половых органов».",
    },
    {
      id: 37,
      arabic:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبَرَصِ، وَالْجُنُونِ، وَالْجُذَامِ، وَسَيِّءِ الْأَسْقَامِ",
      transliteration:
        "«Алла́хумма инни а'у́зу бика мина-ль-бараси, ва-ль-джунуни, ва-ль-джузами, ва сайии-ль-аскам(и)».",
      translation:
        "«О Аллах! Поистине, я прибегаю к Твоей защите от проказы, безумия, лепры и прочих тяжких болезней».",
    },
    {
      id: 38,
      arabic:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْفَقْرِ، وَالْقِلَّةِ، وَالذِّلَّةِ، وَأَعُوذُ بِكَ مِنْ أَنْ أَظْلِمَ أَوْ أُظْلَمَ",
      transliteration:
        "«Алла́хумма инни а'у́зу бика мина-ль-факри, ва-ль-киллати, ва-з-зиллати, ва а'у́зу бика мин ан азлима ав узляма».",
      translation:
        "«О Аллах! Поистине, я прибегаю к Твоей защите от нищеты, нужды и унижения и прибегаю к Твоей защите от того, чтобы поступать несправедливо, и от того, чтобы со мной поступали несправедливо».",
    },
    {
      id: 39,
      arabic:
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ فِعْلَ الْخَيْرَاتِ، وَتَرْكَ الْمُنْكَرَاتِ، وَحُبَّ الْمَسَاكِينِ، وَإِذَا أَرَدْتَ بِعِبَادِكَ فِتْنَةً فَاقْبِضْنِي إِلَيْكَ غَيْرَ مَفْتُونٍ",
      transliteration:
        "«Алла́хумма инни ас'алюка фи-ля-ль-хайрати, ва тарка-ль-мункарати, ва хубба-ль-масакини, ва иза арадта би'ибадика фитнатан фаакбидзни иляйка гайра мафтун(ин)».",
      translation:
        "«О Аллах, поистине, я прошу Тебя дать мне возможность совершать благое, отказаться от дурного и любить нуждающихся, и если же Ты пожелаешь ввести людей в соблазн, то упокой меня несвращённым».",
    },
    {
      id: 40,
      arabic:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ، وَالْمَأْثَمِ وَالْمَغْرَمِ، وَمِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ، وَمِنْ شَرِّ فِتْنَةِ الْغِنَى، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْفَقْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، اللَّهُمَّ اغْسِلْ عَنِّي خَطَايَايَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ، وَنَقِّ قَلْبِي مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنَ الدَّنَسِ، وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ",
      transliteration:
        "«Алла́хумма инни а'у́зу бика мина-ль-касали ва-ль-харами, ва-ль-ма'сами ва-ль-магради, ва мин фитнати-ль-кабри ва 'азаби-ль-кабри, ва мин фитнати-н-Нари ва 'азаби-н-Нари, ва мин шарри фитнати-ль-гина. Ва а'у́зу бика мин фитнати-ль-факри, ва а'у́зу бика мин фитнати-ль-масихи-д-Даджжал(и). Алла́хумма-гсил 'анни хатайайя бима'и-с-сальджи ва-ль-бараци, ва наккы кальби мина-ль-хатайая кама наккайта-с-савба-ль-абйаза мина-д-данаси, ва ба'ид байни ва байна хатайайя кама ба'адта байна-ль-машрики ва-ль-магриб(и)».",
      translation:
        "«О Аллах! Поистине, я прибегаю к Тебе от лени и старческой дряхлости, от грехов и долгов, от искушения могилы и мучений могилы, от искушения огня, и мучений огня, и от зла искушения богатством. О Аллах, я прибегаю к Тебе от искушения бедностью, и я прибегаю к Тебе от искушения Антихриста. О Аллах! Смой мои прегрешения водой, снегом и градом и очисти сердце мое от прегрешений подобно тому, как очищают белую одежду от грязи, и удали меня от прегрешений моих, как удалил Ты восток от запада».",
    },
    {
      id: 41,
      arabic:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ النَّارِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْفِتَنِ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدَّجَّالِ، وَفِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ",
      transliteration:
        "«Алла́хумма инни а'у́зу бика мин 'азаби-ль-кабр(и). Алла́хумма инни а'у́зу бика мин 'азаби-н-Нар(и). Алла́хумма инни а'у́зу бика мина-ль-фитани ма захара минха ва ма батан(а). Ва а'у́зу бика мин фитнати-д-Даджжал(и). Ва фитнати-ль-махйа ва-ль-мамат(и). Алла́хумма инни а'у́зу бика мина-ль-ма'сами ва-ль-маграм(и)».",
      translation:
        "«О Аллах! Поистине, я прибегаю к Тебе от мучений могилы, и прибегаю к Тебе от мук огня, и прибегаю к Тебе от смуты явной и скрытой, я прибегаю к Тебе от испытания Антихриста, от испытаний жизни и смерти. О Аллах! Я прибегаю к Тебе от греховности и непомерного долга».",
    },
    {
      id: 42,
      arabic:
        "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا ۝ رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ",
      transliteration:
        "«Раббана ля тадж'альна фитната-ль-лиллязина кафару. Раббана ля тадж'ална фитната-ль-лиль-кавми-з-залимин(а)».",
      translation:
        "«Господь наш! Не делай нас искушением для тех, которые не веруют. Господь наш! Не делай нас искушением для людей несправедливых».",
    },
    {
      id: 43,
      arabic:
        "رَبَّنَا اجْعَل لَنَا مِن لَّدُنكَ وَلِيًّا وَاجْعَل لَّنَا مِن لَّدُنكَ نَصِيرًا",
      transliteration:
        "«Раббана-дж'аль ляна мин ладунка валийян ва-дж'аль ляна мин ладунка насира(н)».",
      translation:
        "«Господь наш! Назначь нам от Себя покровителя и назначь нам от Себя помощника».",
    },
    {
      id: 44,
      arabic:
        "رَبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَل لِّي مِن لَّدُنكَ سُلْطَانًا نَّصِيرًا",
      transliteration:
        "«Рабби адхильни мудхаля сидкин ва ахриджни мухраджа сидкин ва-дж'аль ли мин ладунка султанан насира(н)».",
      translation:
        "«Господи! Пусть мое пришествие будет правдивым, и пусть мой уход будет правдивым. Даруй мне от Тебя знамение в помощь».",
    },
    {
      id: 45,
      arabic: "رَبِّ نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ",
      transliteration: "«Рабби наджжини мина-ль-кавми-з-залимин(а)».",
      translation: "«Господи! Спаси меня от несправедливых людей».",
    },
    {
      id: 46,
      arabic:
        "رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ ۝ وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ",
      transliteration:
        "«Рабби а'у́зу бика мин хамазати-ш-шайатин(и). Ва а'у́зу бика рабби ан яхдзурун(и)».",
      translation:
        "«Господи! Я прибегаю к Тебе от наваждений дьяволов. Я прибегаю к Тебе, Господи, дабы они не приближались ко мне».",
    },
    {
      id: 47,
      arabic:
        "رَبِّ أَعِنِّي وَلَا تُعِنْ عَلَيَّ، وَانْصُرْنِي وَلَا تَنْصُرْ عَلَيَّ، وَامْكُرْ لِي وَلَا تَمْكُرْ عَلَيَّ، وَاهْدِنِي وَيَسِّرِ الْهُدَى إِلَيَّ، وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ، اللَّهُمَّ اجْعَلْنِي لَكَ شَاكِرًا، لَكَ ذَاكِرًا، لَكَ رَاهِبًا، لَكَ مِطْوَاعًا، إِلَيْكَ مُنِيبًا أَوْ مُخْبِتًا، رَبِّ تَقَبَّلْ تَوْبَتِي، وَاغْسِلْ حَوْبَتِي، وَأَجِبْ دَعْوَتِي، وَثَبِّتْ حُجَّتِي، وَاهْدِ قَلْبِي، وَسَدِّدْ لِسَانِي، وَاسْلُلْ سَخِيمَةَ قَلْبِي",
      transliteration:
        "«Рабби а'инни ва ля ту'ин 'аляйя, ва-нсурни ва ля тансур 'аляйя, ва-мкур ли ва ля тамкур 'аляйя, ва-хдини ва яссир худайя иляйя, ва-нсурни 'аля ман бага 'аляйя. Алла́хумма-дж'ални ляка шакиран, ляка закиран, ляка рахибан, ляка митва'ан иляйка мунибан(н). Рабби такаббаль тавбати, ва-гсиль хавбати, ва аджиб да'вати, ва саббит худджати, ва-хди кальби, ва саддид лисани, ва-слюль сахимата кальби».",
      translation:
        "«Господь мой! Поддержи меня и не оказывай другим поддержку против меня, помоги мне и не оказывай другим помощь против меня, сделай так, чтобы воздаяние, которое Ты уготовил мне, стало для меня благом, а не обратилось против меня, выведи меня на правильный путь, облегчи для меня следование этим путём и окажи мне помощь против тех, кто притеснял меня! Господь мой! Сделай так, чтобы я часто благодарил Тебя, поминал Тебя, боялся Тебя, был покорным Тебе, часто вздыхал и обращался к Тебе с покаянием. Господь мой! Прими моё покаяние, очисти меня от греха, ответь на мою мольбу, укрепи мои доводы, укажи правильный путь моему сердцу, направь на верный путь мой язык и избавь от злобы сердце моё».",
    },
    {
      id: 48,
      arabic:
        "اللَّهُمَّ احْفَظْنِي بِالْإِسْلَامِ قَائِمًا، وَاحْفَظْنِي بِالْإِسْلَامِ قَاعِدًا، وَاحْفَظْنِي بِالْإِسْلَامِ رَاقِدًا، وَلَا تُشْمِتْ بِي عَدُوًّا حَاسِدًا، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ كُلِّ خَيْرٍ خَزَائِنُهُ بِيَدِكَ، وَأَعُوذُ بِكَ مِنْ كُلِّ شَرٍّ خَزَائِنُهُ بِيَدِكَ",
      transliteration:
        "«Алла́хумма-хфазни би-ль-Ислями ка'има(н), ва-хфазни би-ль-Ислями ка'ида(н), ва-хфазни би-ль-Ислями ракида(н). Ва ля тушмит би 'адуввун хасида(н). Алла́хумма инни ас'алюка мин кулли хайрин хаза'инуху бийадик(а). Ва а'у́зу бика мин кулли шаррин хаза'инуху бийадик(а)».",
      translation:
        "«О Аллах! Храни меня посредством Ислама, когда я буду стоять, и храни меня посредством Ислама, когда я буду сидеть, и храни меня посредством Ислама, когда я буду спать, и не позволяй злорадствовать надо мной ни врагу, ни завистнику. О Аллах! Поистине я прошу тебя о всяком благе, сокровища которого в Твоей руке, и прибегаю к Твоей защите от каждого зла, сокровища которого в Твоей руке».",
    },
  ],
};
