export const chapterOne = {
  id: "dua-start",
  title: "ИСПРАШИВАНИЕ У АЛЛАХА РАЯ И ЗАЩИТЫ ОТ АДА",
  duas: [
    {
      id: 1,
      arabic: "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ",
      transliteration:
        "«Алла́хумма, инни́ ас'алюка-ль-Джанната\nва а'узу бика мина-н-На́р(и)».",
      translation: "«О, Аллах! Прошу у Тебя Рая\nи прибегаю к Твоей защите от Ада».",
    },
    {
      id: 2,
      arabic: "رَبِّ ابْنِ لِي عِندَكَ بَيْتًا فِي الْجَنَّةِ",
      transliteration: "«Рабби-бни ли́ 'индака байтан фи-ль-Джаннат(и)».",
      translation: "«О, Господь! Возведи мне дом в Раю».",
    },
    {
      id: 3,
      arabic:
        "رَبِّ أَلْحِقْنِي بِالصَّالِحِينَ ۝ وَاجْعَل لِّي لِسَانَ صِدْقٍ فِي الْآخِرِينَ ۝\nوَاجْعَلْنِي مِن وَرَثَةِ جَنَّةِ النَّعِيمِ ۝",
      transliteration:
        "«Рабби “Альхикни́ би-с-салихи́н(а), ва-дж'аль ли́ лиса́на сидкин\nфи-ль-а́хири́н(а), ва-дж'альни́ мин варасати джаннати-н-наи́м(и)».",
      translation:
        "«О, Господь! Воссоедини меня с праведниками. Оставь обо\nмне правдивую молву в последующих поколениях. Сделай\nменя одним из наследников Сада Блаженства».",
    },
    {
      id: 4,
      arabic: "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا",
      transliteration:
        "«Раббана̄-сриф 'анна̄ 'аза̄ба Джаха̄ннама, инна 'аза̄баха̄ кя̄на\nгара̄ма(н)».",
      translation:
        "«Господь наш! Отврати от нас мучения в Геене, поскольку\nмучения там не отступают».",
    },
    {
      id: 5,
      arabic:
        "اللَّهُمَّ رَبَّ جِبْرَائِيلَ وَمِيكَائِيلَ وَرَبَّ إِسْرَافِيلَ، أَعُوذُ بِكَ مِنْ حَرِّ النَّارِ وَمِنْ عَذَابِ الْقَبْرِ",
      transliteration:
        "«Алла́хумма Рабба Джибра́йля, ва Мика́йля, ва Рабба Исрафи́ля,\nа'у́зу бика мин харри-н-на́ри, ва мин 'аза́би-ль-кабр(и)».",
      translation:
        "«О, Аллах! Господь Джибраиля и Микаиля, и Господь\nИсрафиля. Прибегаю к Твоей защите от жара адского огня и\nот могильных мук».",
    },
  ],
};

export const chapterTwo = {
  id: "dua-forgiveness-mercy",
  title: "ИСПРАШИВАНИЕ У АЛЛАХА ПРОЩЕНИЯ И МИЛОСТИ",
  duas: [
    {
      id: 1,
      arabic: "رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ",
      transliteration: "«Раббана́ а́манна́ фа-гфир ляна́ зуну́бана, ва кына́ 'аза́ба-н-на́р(и)».",
      translation:
        "«Господь наш! Воистину, мы уверовали. Прости же нам наши грехи и защити нас от мучений в Огне».",
    },
    {
      id: 2,
      arabic:
        "وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ ۝ رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ ۝",
      transliteration:
        "«Ва каффир 'анна́ саййиа́тина ва таваффана́ ма'а-ль-абра́р(и).\nРаббана́ а́тина ма́ ва'адтана́ 'аля́ русулика ва ля́ тухзина́\nйаума-ль-кыя́мати иннакя́ ля́ тухлифу-ль-ми'а́д(а)».",
      translation:
        "«Отпусти нам наши прегрешения и умертви нас вместе с благочестивыми. Господь наш! Даруй нам то, что Ты обещал нам через Своих посланников, и не позорь нас в День воскресения, ведь Ты не нарушаешь обещаний».",
    },
    {
      id: 3,
      arabic: "رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا",
      transliteration: "«Раббана́-гфир ляна́ зуну́бана́ ва исра́фана́ фи́ амрина́».",
      translation:
        "«Господь наш! Прости нам наши грехи и излишества,\nкоторые мы допустили в нашем деле».",
    },
    {
      id: 4,
      arabic:
        "رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
      transliteration:
        "«Раббана́ залямна́ анфусана́ ва ин лям тагфир ляна́ ва\nтархамна́ ланаку́нанна мина-ль-ха́сири́н(а)».",
      translation:
        "«Господь наш! Мы поступили несправедливо по\nотношению к себе, и если Ты не простишь нас и не\nсмилостивишься над нами, то мы непременно окажемся\nодними из потерпевших урон».",
    },
    {
      id: 5,
      arabic: "رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الرَّاحِمِينَ",
      transliteration:
        "«Раббана́ а́манна́ фа-гфир ляна́ ва-рхамна́ ва Анта хайру-р-\nра́хими́н(а)».",
      translation:
        "«Господь наш! Мы уверовали. Прости же нас и помилуй,\nибо Ты — Наилучший из милосердных».",
    },
  ],
};
