export const chapterOne = {
  id: "dua-start",
  title: "ИСПРАШИВАНИЕ У АЛЛАХА РАЯ И ЗАЩИТЫ ОТ АДА",
  duas: [
    {
      id: 1,
      arabic: "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ",
      transliteration:
        "«Алла́хумма, инни́ ас'алюка-ль-Джанната\nва а'узу бика мина-н-На́р(и)».",
      translation: "«О, Аллах! Прошу у Тебя Рая\nи прибегаю к Твоей защите от Ада».",
    },
    {
      id: 2,
      arabic: "رَبِّ ابْنِ لِي عِندَكَ بَيْتًا فِي الْجَنَّةِ",
      transliteration: "«Рабби-бни ли́ 'индака байтан фи-ль-Джаннат(и)».",
      translation: "«О, Господь! Возведи мне дом в Раю».",
    },
    {
      id: 3,
      arabic:
        "رَبِّ أَلْحِقْنِي بِالصَّالِحِينَ ۝ وَاجْعَل لِّي لِسَانَ صِدْقٍ فِي الْآخِرِينَ ۝\nوَاجْعَلْنِي مِن وَرَثَةِ جَنَّةِ النَّعِيمِ ۝",
      transliteration:
        "«Рабби “Альхикни́ би-с-салихи́н(а), ва-дж'аль ли́ лиса́на сидкин\nфи-ль-а́хири́н(а), ва-дж'альни́ мин варасати джаннати-н-наи́м(и)».",
      translation:
        "«О, Господь! Воссоедини меня с праведниками. Оставь обо\nмне правдивую молву в последующих поколениях. Сделай\nменя одним из наследников Сада Блаженства».",
    },
    {
      id: 4,
      arabic: "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا",
      transliteration:
        "«Раббана̄-сриф 'анна̄ 'аза̄ба Джаха̄ннама, инна 'аза̄баха̄ кя̄на\nгара̄ма(н)».",
      translation:
        "«Господь наш! Отврати от нас мучения в Геене, поскольку\nмучения там не отступают».",
    },
    {
      id: 5,
      arabic:
        "اللَّهُمَّ رَبَّ جِبْرَائِيلَ وَمِيكَائِيلَ وَرَبَّ إِسْرَافِيلَ، أَعُوذُ بِكَ مِنْ حَرِّ النَّارِ وَمِنْ عَذَابِ الْقَبْرِ",
      transliteration:
        "«Алла́хумма Рабба Джибра́йля, ва Мика́йля, ва Рабба Исрафи́ля,\nа'у́зу бика мин харри-н-на́ри, ва мин 'аза́би-ль-кабр(и)».",
      translation:
        "«О, Аллах! Господь Джибраиля и Микаиля, и Господь\nИсрафиля. Прибегаю к Твоей защите от жара адского огня и\nот могильных мук».",
    },
  ],
};
