export const chapterOne = {
  id: "dua-start",
  title: "ИСПРАШИВАНИЕ У АЛЛАХА РАЯ И ЗАЩИТЫ ОТ АДА",
  duas: [
    {
      id: 1,
      arabic: "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ",
      transliteration:
        "«Алла́хумма, инни́ ас'алюка-ль-Джанната ва а'узу бика мина-н-На́р(и)».",
      translation: "«О, Аллах! Прошу у Тебя Рая и прибегаю к Твоей защите от Ада».",
    },
    {
      id: 2,
      arabic: "رَبِّ ابْنِ لِي عِندَكَ بَيْتًا فِي الْجَنَّةِ",
      transliteration: "«Рабби-бни ли́ 'индака байтан фи-ль-Джаннат(и)».",
      translation: "«О, Господь! Возведи мне дом в Раю».",
    },
    {
      id: 3,
      arabic:
        "رَبِّ أَلْحِقْنِي بِالصَّالِحِينَ ۝ وَاجْعَل لِّي لِسَانَ صِدْقٍ فِي الْآخِرِينَ ۝ وَاجْعَلْنِي مِن وَرَثَةِ جَنَّةِ النَّعِيمِ ۝",
      transliteration:
        "«Рабби “Альхикни́ би-с-салихи́н(а), ва-дж'аль ли́ лиса́на сидкин фи-ль-а́хири́н(а), ва-дж'альни́ мин варасати джаннати-н-наи́м(и)».",
      translation:
        "«О, Господь! Воссоедини меня с праведниками. Оставь обо мне правдивую молву в последующих поколениях. Сделай меня одним из наследников Сада Блаженства».",
    },
    {
      id: 4,
      arabic: "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا",
      transliteration:
        "«Раббана̄-сриф 'анна̄ 'аза̄ба Джаха̄ннама, инна 'аза̄баха̄ кя̄на гара̄ма(н)».",
      translation:
        "«Господь наш! Отврати от нас мучения в Геене, поскольку мучения там не отступают».",
    },
    {
      id: 5,
      arabic:
        "اللَّهُمَّ رَبَّ جِبْرَائِيلَ وَمِيكَائِيلَ وَرَبَّ إِسْرَافِيلَ، أَعُوذُ بِكَ مِنْ حَرِّ النَّارِ وَمِنْ عَذَابِ الْقَبْرِ",
      transliteration:
        "«Алла́хумма Рабба Джибра́йля, ва Мика́йля, ва Рабба Исрафи́ля, а'у́зу бика мин харри-н-на́ри, ва мин 'аза́би-ль-кабр(и)».",
      translation:
        "«О, Аллах! Господь Джибраиля и Микаиля, и Господь Исрафиля. Прибегаю к Твоей защите от жара адского огня и от могильных мук».",
    },
  ],
};

export const chapterTwo = {
  id: "dua-forgiveness-mercy",
  title: "ИСПРАШИВАНИЕ У АЛЛАХА ПРОЩЕНИЯ И МИЛОСТИ",
  duas: [
    {
      id: 1,
      arabic: "رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ",
      transliteration: "«Раббана́ а́манна́ фа-гфир ляна́ зуну́бана, ва кына́ 'аза́ба-н-на́р(и)».",
      translation:
        "«Господь наш! Воистину, мы уверовали. Прости же нам наши грехи и защити нас от мучений в Огне».",
    },
    {
      id: 2,
      arabic:
        "وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ ۝ رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ ۝",
      transliteration:
        "«Ва каффир 'анна́ саййиа́тина ва таваффана́ ма'а-ль-абра́р(и). Раббана́ а́тина ма́ ва'адтана́ 'аля́ русулика ва ля́ тухзина́ йаума-ль-кыя́мати иннакя́ ля́ тухлифу-ль-ми'а́д(а)».",
      translation:
        "«Отпусти нам наши прегрешения и умертви нас вместе с благочестивыми. Господь наш! Даруй нам то, что Ты обещал нам через Своих посланников, и не позорь нас в День воскресения, ведь Ты не нарушаешь обещаний».",
    },
    {
      id: 3,
      arabic: "رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا",
      transliteration: "«Раббана́-гфир ляна́ зуну́бана́ ва исра́фана́ фи́ амрина́».",
      translation:
        "«Господь наш! Прости нам наши грехи и излишества, которые мы допустили в нашем деле».",
    },
    {
      id: 4,
      arabic:
        "رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
      transliteration:
        "«Раббана́ залямна́ анфусана́ ва ин лям тагфир ляна́ ва тархамна́ ланаку́нанна мина-ль-ха́сири́н(а)».",
      translation:
        "«Господь наш! Мы поступили несправедливо по отношению к себе, и если Ты не простишь нас и не смилостивишься над нами, то мы непременно окажемся одними из потерпевших урон».",
    },
    {
      id: 5,
      arabic: "رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الرَّاحِمِينَ",
      transliteration:
        "«Раббана́ а́манна́ фа-гфир ляна́ ва-рхамна́ ва Анта хайру-р- ра́хими́н(а)».",
      translation:
        "«Господь наш! Мы уверовали. Прости же нас и помилуй, ибо Ты — Наилучший из милосердных».",
    },
    {
      id: 6,
      arabic: "رَبِّ اغْفِرْ وَارْحَمْ وَأَنْتَ خَيْرُ الرَّاحِمِينَ",
      transliteration: "«Рабби-гфир, ва-рхам ва Анта хайрy-р-ра́хими́н(а)».",
      translation: "«Господи, прости и помилуй, ведь Ты — Наилучший из милосердных!»",
    },
    {
      id: 7,
      arabic:
        "رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَّحِيمٌ",
      transliteration:
        "«Раббана́-гфир ляна́ ва ли ихва́нина-ллязи́на сабаку́на би-ль-и́ма́ни, ва ля́ тадж'аль фи́ кулю́бина́ гилля-ль-лиллязи́на а́ману, Раббана́ иннака Ра'у́фун Рахи́м(ун)».",
      translation:
        "«Господь наш! Прости нас и наших братьев, которые уверовали раньше нас. Не насаждай в наших сердцах ненависти и зависти к тем, кто уверовал. Господь наш! Воистину, Ты — Сострадательный, Милосердный».",
    },
    {
      id: 8,
      arabic:
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللَّهُ، الْأَحَدُ الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ، أَنْ تَغْفِرَ لِي ذُنُوبِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
      transliteration:
        "«Алла́хумма инни́ ас'алюка йа́ Алла́ху, аль-Ахаду-с-Самаду, аль-лязи́ лям ялид ва лям ю́ляд, ва ля́м якун ляху́ куфуван ахада(ун), ан тагфира ли́ зуну́би, иннака Анта-ль-Гафу́ру-р-Рахи́м(у)».",
      translation:
        "«О Аллах! Поистине, я прошу Тебя, о Аллах, о Единый, Самодостаточный, Который не родил и не был рожден, Которому нет равных, простить мне мои грехи, поистине Ты Прощающий, Милосердный».",
    },
    {
      id: 9,
      arabic:
        "اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي، وَإِسْرَافِي فِي أَمْرِي، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، اللَّهُمَّ اغْفِرْ لِي جِدِّي وَهَزْلِي، وَخَطَئِي وَعَمْدِي، وَكُلُّ ذَلِكَ عِنْدِي، اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ، وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
      transliteration:
        "«Алла́хумма-гфир ли́ хати́'ати́ ва джахли́, ва исра́фи́ фи́ 'амри́, ва ма́ Анта а'ляму бини́ минни́. Алла́хумма-гфир ли́ джидди́ ва хазли́, ва хата́'и́ ва 'амди́, ва куллю за́лика 'инди́. Алла́хумма-гфир ли́ ма́ каддамту ва ма́ аххарту, ва ма́ асрарту ва ма́ а'лянту, ва ма́ Анта а'ляму бихи́ минни́. Анта-ль-Мукаддиму, ва Анта-ль-Му'аххиру, ва Анта 'аля́ кулли шай'ин кади́р(ун)».",
      translation:
        "«О Аллах! Прости мне мой грех и моё невежество, неумеренность в моих делах и то, о чём Ты знаешь лучше меня! О Аллах! Прости мне сделанное мной всерьёз и в шутку, по ошибке и намеренно, ибо всё это мне присуще. О Аллах! Прости мне совершённое мной прежде и то, что ещё не совершено, то, что я совершил тайно, и что совершил явно и то, о чём Ты знаешь лучше меня. Ты — Выдвигающий вперёд, и Ты — Отодвигающий назад и Ты надо всем властен».",
    },
    {
      id: 10,
      arabic:
        "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلٰهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَىٰ عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
      transliteration:
        "«Алла́хумма анта рабби́, ля̄ иля̄ха илля̄ ант, халякъта-нӣ ва ана̄ ‘абдука, ва ана̄ ‘аля̄ ‘ахдика ва ва‘дика ма-стата‘ту, а‘ӯзу бика мин шарри ма̄ сана‘ту, абӯ’у ляка би-ни‘матика ‘аляйя, ва абӯ’у ляка би-занбӣ, фа-гфир лӣ, фа-иннаху ля̄ ягфиру-з-зунӯба илля̄ ант.»",
      translation:
        "«О Аллах! Ты — Господь мой, и нет бога, кроме Тебя; Ты создал меня, а я — Твой раб, и я буду хранить верность Тебе, пока у меня хватит сил. Прибегаю к Твоей защите от зла того, что я сделал, признаю милость, оказанную Тобой мне, и признаю грех свой, прости же меня, ибо, поистине, никто не прощает грехов, кроме Тебя».",
    },
    {
      id: 11,
      arabic:
        "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ، وَارْحَمْنِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
      transliteration:
        "«Алла́хумма иннӣ залямту нафсӣ зульман кясӣран, ва ля̄ ягфиру-з-зунӯба илля̄ ант, фа-гфир лӣ магфиратан мин ‘индика, вархамнӣ, иннака анта-ль-Гафӯру-р-Рахӣм.»",
      translation:
        "«О, Аллах! Я совершил грехи, а никто, кроме Тебя не прощает грехов. Прости же меня и даруй мне Свое прощение и помилуй меня, поистине, Ты – Прощающий, Милосердный».",
    },

    {
      id: 12,
      arabic:
        "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلَانِيَتَهُ وَسِرَّهُ",
      transliteration:
        "«Алла́хумма-гфир ли́ занби́ куллаху, диккаху ва джиллаху, ва авваляху ва а̄хыраху, ва ‘аля̄нийятаху ва сирраху».",
      translation:
        "«О Аллах, прости мне все мои грехи: малые и большие, первые и последние, явные и скрытые».",
    },
    {
      id: 13,
      arabic:
        "اللَّهُمَّ طَهِّرْنِي بِالثَّلْجِ وَالْبَرَدِ وَالْمَاءِ الْبَارِدِ، اللَّهُمَّ طَهِّرْنِي مِنَ الذُّنُوبِ وَالْخَطَايَا، كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنَ الْوَسَخِ",
      transliteration:
        "«Алла́хумма таххирни́ бис-сальджи валь-баради валь-ма̄’иль-ба̄риди, Алла́хумма таххирни́ мина-з-зуну́би валь-хата̄йа̄, кама̄ юнакка-с-саўбу-ль-абйаду миналь-васахи».",
      translation:
        "«О Аллах, очисти меня снегом, градом и прохладной водой. О Аллах, очисти меня от грехов и прегрешений, как очищают белую одежду от грязи».",
    },
    {
      id: 14,
      arabic:
        "رَبِّ اغْفِرْ لِي، وَتُبْ عَلَيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ",
      transliteration:
        "«Рабби-гфир ли́, ва туб ‘аляйя, иннака анта-т-Тавва̄бу-р-Рахи́м».",
      translation:
        "«Господь мой, прости меня и прими моё покаяние. Поистине, Ты — Принимающий покаяние, Милосердный».",
    },
    {
      id: 15,
      arabic:
        "اللَّهُمَّ اغْفِرْ لِحَيِّنَا، وَمَيِّتِنَا، وَصَغِيرِنَا وَكَبِيرِنَا، وَذَكَرِنَا وَأُنْثَانَا، وَشَاهِدِنَا وَغَائِبِنَا، اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الْإِيمَانِ، وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الْإِسْلَامِ",
      transliteration:
        "«Алла́хумма-гфир ли-хаййина́ ва маййитина́, ва сагыйрина́ ва кабийрина́, ва закарина́ ва унса́на, ва ша̄хидина́ ва га̄ибина́. Алла́хумма ман ахйайтаху́ минна́ фа-ахйихи́ ‘аля-ль-има́ни, ва ман таваффайтаху́ минна́ фа-таваффаху́ ‘аля-ль-исля́м(и).»",
      translation:
        "«О Аллах, прости нашим живым и мёртвым, малым и старым, мужчинам и женщинам, присутствующим и отсутствующим. О Аллах, кого из нас Ты оставляешь в живых, тому помоги жить с верой, а кого из нас Ты упокоиваешь, того упокой в Исламе.»",
    },
    {
      id: 16,
      arabic:
        "اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَخَطَايَايَ، اللَّهُمَّ أَنْعِشْنِي، وَاجْبُرْنِي، وَاهْدِنِي لِصَالِحِ الْأَعْمَالِ وَالْأَخْلَاقِ، فَإِنَّهُ لَا يَهْدِي لِصَالِحِهَا وَلَا يَصْرِفُ سَيِّئَهَا إِلَّا أَنْتَ",
      transliteration:
        "«Алла́хумма-гфир ли́ зунуби́ ва хатая́йя. Алла́хумма ан‘ишни́, ваджбурни́ ваһдини́ ли-салихиль-а‘ма́ли валь-ахля́ки, фа-иннаху ля́ яһди ли-салихиха́ ва ля́ ясрифу саййи’аха́ илля́ ант.»",
      translation:
        "«О Аллах, прости мне все мои грехи и прегрешения. О Аллах, подкрепи меня, помоги мне и укажи мне путь к благим делам и нравственным качествам, ибо, поистине, никто не укажет путь к ним и не отвратит от дурных дел и нравов, кроме Тебя.»",
    },
    {
      id: 17,
      arabic:
        "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي، وَأَخْسِئْ شَيْطَانِي، وَفُكَّ رِهَانِي",
      transliteration:
        "«Алла́хумма-гфир ли́ занби́, ва ахси’ шайта́ни, ва фукка риха́ни.»",
      translation:
        "«О Аллах, прости мой грех, прогони моего шайтана и освободи меня от его оков.»",
    },
    {
      id: 18,
      arabic:
        "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ",
      transliteration:
        "«Алла́хумма инна́ на‘у́зу бика мин ан нушрика бика шай’ан на‘лямуху, ва настагфирука лима́ ля́ на‘лямух(у).»",
      translation:
        "«О Аллах, поистине, мы ищем у Тебя защиты от того, чтобы сознательно придавать Тебе сотоварищей, и просим у Тебя прощения за то, что нам неизвестно».",
    },
    {
      id: 19,
      arabic:
        "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَعَافِنِي، وَارْزُقْنِي، وَارْفَعْنِي",
      transliteration:
        "«Алла́хумма-гфир ли́, вархамни́, ваһдини́, ва ‘а̄фини́, варзукни́, варфа‘ни́.»",
      translation:
        "«О Аллах, прости меня, помилуй меня, наставь меня, даруй мне здоровье, надели меня уделом и возвысь меня.»",
    },
  ],
};

export const chapterThree = {
  id: "dua-guidance-steadfastness",
  title: "ИСПРАШИВАНИЕ У АЛЛАХА НАСТАВЛЕНИЯ И СТОЙКОСТИ",
  duas: [
    {
      id: 1,
      arabic: "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى، وَالتُّقَى، وَالْعَفَافَ، وَالْغِنَى",
      transliteration:
        "«Алла́хумма инни́ ас’алюка-ль-худа́, ват-тука́, валь-‘афа́фа, валь-гина́».",
      translation:
        "«О Аллах, поистине, я прошу у Тебя наставления на прямой путь, богобоязненности, целомудрия и достатка».",
    },
    {
      id: 2,
      arabic: "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالسَّدَادَ",
      transliteration:
        "«Алла́хумма инни́ ас’алюка-ль-худа́ вас-сада́д».",
      translation:
        "«О Аллах, поистине, я прошу у Тебя наставления на прямой путь и правильности во всём».",
    },
    {
      id: 3,
      arabic:
        "اللَّهُمَّ اسْتَهْدِكَ لِأَرْشَدِ أَمْرِي، وَأَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي",
      transliteration:
        "«Алла́хумма астахдика ли-аршади амри́, ва а‘у́зу бика мин шарри нафси́».",
      translation:
        "«О Аллах, я прошу Тебя направить меня к наиболее правильному в моих делах и прибегаю к Твоей защите от зла моей души».",
    },
    {
      id: 4,
      arabic:
        "اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ، وَعَافِنِي فِيمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ، إِنَّكَ تَقْضِي، وَلَا يُقْضَى عَلَيْكَ، وَإِنَّهُ لَا يَذِلُّ مَنْ وَالَيْتَ، وَلَا يَعِزُّ مَنْ عَادَيْتَ، تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ",
      transliteration:
        "«Алла́хумма-һдини́ фи́ман һадайт, ва ‘а́фини́ фи́ман ‘а́файт, ва тавалляни́ фи́ман таваллайт, ва ба́рик ли́ фи́ма а‘тайт, ва кыни́ шарра ма́ кадайт, иннака такды́ ва ля́ юкда́ ‘аляйк, ва иннаху ля́ язиллю ман ва́лайт, ва ля́ я‘иззу ман ‘а́дайт, таба́ракта раббана́ ва та‘а́лайт».",
      translation:
        "«О Аллах, веди меня прямым путём среди тех, кого Ты наставил, даруй мне благополучие среди тех, кому Ты даровал его, опекай меня среди тех, кого Ты взял под Свою опеку, благослови для меня то, что Ты мне даровал, и защити меня от зла того, что Ты предопределил. Поистине, Ты выносишь решение, и никто не выносит решения против Тебя. Не будет унижен тот, кого Ты поддержал, и не будет возвеличен тот, с кем Ты враждуешь. Благословен Ты, Господь наш, и превыше всего Ты».",
    },
    {
      id: 5,
      arabic:
        "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا، وَفِي بَصَرِي نُورًا، وَفِي سَمْعِي نُورًا، وَعَنْ يَمِينِي نُورًا، وَعَنْ يَسَارِي نُورًا، وَفَوْقِي نُورًا، وَتَحْتِي نُورًا، وَأَمَامِي نُورًا، وَخَلْفِي نُورًا، وَاجْعَلْ لِي نُورًا",
      transliteration:
        "«Алла́хумма-дж‘аль фи́ кальби́ ну́ран, ва фи́ басари́ ну́ран, ва фи́ сам‘и́ ну́ран, ва ‘ан йами́ни́ ну́ран, ва ‘ан йаса́ри́ ну́ран, ва фавкы́ ну́ран, ва тахти́ ну́ран, ва ама́ми́ ну́ран, ва халфи́ ну́ран, вадж‘аль ли́ ну́ран».",
      translation:
        "«О Аллах, помести в сердце моё свет, и в зрение моё свет, и в слух мой свет, и справа от меня свет, и слева от меня свет, и над мной свет, и подо мной свет, и впереди меня свет, и позади меня свет, и даруй мне свет».",
    },
    {
      id: 6,
      arabic:
        "رَبَّنَا آتِنَا مِنْ لَدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا",
      transliteration:
        "«Раббана́ а́тина́ мин ладунка рахматан ва хаййи’ ляна́ мин амрина́ рашада́н».",
      translation:
        "«Господь наш, даруй нам от Себя милость и устрой для нас в нашем деле правильный путь».",
    },
    {
      id: 7,
      arabic:
        "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً ۚ إِنَّكَ أَنْتَ الْوَهَّابُ",
      transliteration:
        "«Раббана́ ля́тузигъ кулю́бана́ ба‘да из хадайтана́ ва хаб ляна́ мин ладунка рахматан, иннака Анта-ль-Вахха́б».",
      translation:
        "«Господь наш, не отклоняй наши сердца после того, как Ты наставил нас, и даруй нам от Себя милость. Поистине, Ты — Дарующий».",
    },
    {
      id: 8,
      arabic:
        "يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِي عَلَىٰ دِينِكَ، اللَّهُمَّ مُصَرِّفَ الْقُلُوبِ صَرِّفْ قُلُوبَنَا عَلَىٰ طَاعَتِكَ",
      transliteration:
        "«Йа́ Мукаллиба-ль-кулю́б, саббит кальби́ ‘аля́ ди́ник. Алла́хумма Мусаррифа-ль-кулю́б, сарриф кулю́бана́ ‘аля́ та́‘атик».",
      translation:
        "«О Переворачивающий сердца, укрепи моё сердце в Твоей религии. О Аллах, Направляющий сердца, направь наши сердца к повиновению Тебе».",
    },
    {
      id: 9,
      arabic:
        "اللَّهُمَّ لَكَ أَسْلَمْتُ، وَبِكَ آمَنْتُ، وَعَلَيْكَ تَوَكَّلْتُ، وَإِلَيْكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ، اللَّهُمَّ إِنِّي أَعُوذُ بِعِزَّتِكَ، لَا إِلَٰهَ إِلَّا أَنْتَ، أَنْ تُضِلَّنِي، أَنْتَ الْحَيُّ الَّذِي لَا يَمُوتُ، وَالْجِنُّ وَالْإِنْسُ يَمُوتُونَ",
      transliteration:
        "«Алла́хумма ляка аслямту, ва бика а́манту, ва ‘аляйка таваккальту, ва иляйка анабту, ва бика ха́самту. Алла́хумма инни́ а‘у́зу би‘иззатик, ля́ иля́ха илля́ Ант, ан тудылляни́. Анта-ль-Хаййу-ллязи́ ля́ яму́ту, валь-джинну валь-инсу яму́ту́н».",
      translation:
        "«О Аллах, Тебе я предался, в Тебя уверовал, на Тебя уповаю, к Тебе обращаюсь и ради Тебя веду спор. О Аллах, поистине, я прибегаю к Твоему могуществу — нет божества, кроме Тебя — от того, чтобы Ты дал мне сбиться с пути. Ты — Живой, Который не умирает, а джинны и люди умирают».",
    },
    {
      id: 10,
      arabic:
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ الثَّبَاتَ فِي الْأَمْرِ، وَالْعَزِيمَةَ عَلَى الرُّشْدِ، وَأَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ، وَعَزَائِمَ مَغْفِرَتِكَ، وَأَسْأَلُكَ شُكْرَ نِعْمَتِكَ، وَحُسْنَ عِبَادَتِكَ، وَأَسْأَلُكَ قَلْبًا سَلِيمًا، وَلِسَانًا صَادِقًا، وَأَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا تَعْلَمُ، إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ",
      transliteration:
        "«Алла́хумма инни́ ас’алюка-с-саба́та филь-амри, валь-‘ази́мата ‘аля-р-рушди, ва ас’алюка му́джиба́ти рахматик, ва ‘аза́има магфиратик, ва ас’алюка шукра ни‘матик, ва хусна ‘иба́датик, ва ас’алюка кальбан сали́ман, ва лиса́нан са́дикан, ва ас’алюка мин хайри ма́ та‘лям, ва а‘у́зу бика мин шарри ма́ та‘лям, ва астагфирука лима́ та‘лям, иннака Анта ‘Алля́му-ль-гуйу́б».",
      translation:
        "«О Аллах, поистине, я прошу у Тебя стойкости в этом деле и решимости следовать прямым путём. Прошу у Тебя того, что влечёт за собой Твою милость, и того, что приводит к Твоему прощению. Прошу у Тебя благодарности за Твои милости и наилучшего поклонения Тебе. Прошу у Тебя здорового сердца и правдивого языка. Прошу у Тебя из того блага, которое Ты знаешь, и прибегаю к Тебе от зла того, которое Ты знаешь, и прошу у Тебя прощения за то, что Ты знаешь. Поистине, Ты — Знающий сокровенное».",
    },
    {
      id: 11,
      arabic:
        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَضِلَّ أَوْ أُضَلَّ، أَوْ أَزِلَّ أَوْ أُزَلَّ، أَوْ أَظْلِمَ أَوْ أُظْلَمَ، أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَيَّ",
      transliteration:
        "«Алла́хумма инни́ а‘у́зу бика ан адылля ау удалля, ау азилля ау узалля, ау азлима ау узляма, ау аджхаля ау юджхаля ‘аляйя».",
      translation:
        "«О Аллах, поистине, я прибегаю к Тебе от того, чтобы самому сбиться с пути или быть введённым в заблуждение, ошибиться самому или быть ввергнутым в ошибку, поступить несправедливо самому или подвергнуться несправедливости, проявить невежество самому или стать жертвой невежества по отношению ко мне».",
    },
  ],
};

export const chapterFour = {
  id: "dua-good-this-world-hereafter",
  title: "ИСПРАШИВАНИЕ У АЛЛАХА БЛАГА В ОБОИХ МИРАХ",
  duas: [
    {
      id: 1,
      arabic:
        "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
      transliteration:
        "«Раббана́ а́тина́ фи-д-дунья́ хасанатан ва фи-ль-а́хирати хасанатан ва кына́ ‘аза́ба-н-на́р».",
      translation:
        "«Господь наш, даруй нам добро в этом мире и добро в Последней жизни и защити нас от мучений Огня».",
    },
    {
      id: 2,
      arabic:
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ بِهِ عَبْدُكَ وَنَبِيُّكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَعُوذُ بِكَ مِنَ النَّارِ، وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْرًا",
      transliteration:
        "«Алла́хумма инни́ ас’алюка мина-ль-хайри куллихи, ‘а́джилихи ва а̄джилихи, ма́ ‘алимту минху ва ма́ лям а‘лям. Ва а‘у́зу бика мина-ш-шарри куллихи, ‘а́джилихи ва а̄джилихи, ма́ ‘алимту минху ва ма́ лям а‘лям. Алла́хумма инни́ ас’алюка мин хайри ма́ са’аляка ‘абдука ва набийюка, ва а‘у́зу бика мин шарри ма́ ‘а̄за биһи ‘абдука ва набийюка. Алла́хумма инни́ ас’алюка-ль-джанната ва ма́ карраба илайһа мин кавлин ау ‘амалин, ва а‘у́зу бика мина-н-на́ри ва ма́ карраба илайһа мин кавлин ау ‘амалин, ва ас’алюка ан тадж‘аля кулля када̄’ин кадайтаху ли хайран».",
      translation:
        "«О Аллах, поистине, я прошу у Тебя всякого блага — скорого и отдалённого, того, что мне известно, и того, чего я не знаю. И прибегаю к Твоей защите от всякого зла — скорого и отдалённого, того, что мне известно, и того, чего я не знаю. О Аллах, поистине, я прошу у Тебя того блага, о котором просил Тебя Твой раб и Твой пророк, и прибегаю к Тебе от зла того, от которого прибегал к Тебе Твой раб и Твой пророк. О Аллах, поистине, я прошу у Тебя Рая и всего, что приближает к нему из слов и дел, и прибегаю к Тебе от Огня и всего, что приближает к нему из слов и дел. И прошу Тебя сделать всякое решение, которое Ты предопределил для меня, благим».",
    },
    {
      id: 3,
      arabic:
        "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي، وَوَسِّعْ لِي فِي دَارِي، وَبَارِكْ لِي فِيمَا رَزَقْتَنِي",
      transliteration:
        "«Алла́хумма-гфир ли́ занби́, ва васси‘ ли́ фи́ да́ри, ва ба́рик ли́ фи́ма разактани́».",
      translation:
        "«О Аллах, прости мне мой грех, сделай мой дом просторным и благослови то, чем Ты наделил меня».",
    },
    {
      id: 4,
      arabic:
        "اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي وَعَلِّمْنِي مَا يَنْفَعُنِي وَزِدْنِي عِلْمًا",
      transliteration:
        "«Алла́хумма-нфа‘ни́ бима́ ‘алламтани́ ва ‘аллимни́ ма́ янфа‘уни́ ва зидни́ ‘ильман».",
      translation:
        "«О Аллах, сделай полезным для меня то, чему Ты меня научил, научи меня тому, что принесёт мне пользу, и прибавь мне знания».",
    },
    {
      id: 5,
      arabic:
        "اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا يَحُولُ بَيْنَنَا وَبَيْنَ مَعَاصِيكَ، وَمِنْ طَاعَتِكَ مَا تُبَلِّغُنَا بِهِ جَنَّتَكَ، وَمِنَ الْيَقِينِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مُصِيبَاتِ الدُّنْيَا، وَمَتِّعْنَا بِأَسْمَاعِنَا وَأَبْصَارِنَا وَقُوَّتِنَا مَا أَحْيَيْتَنَا، وَاجْعَلْهُ الْوَارِثَ مِنَّا، وَاجْعَلْ ثَأْرَنَا عَلَىٰ مَنْ ظَلَمَنَا، وَانْصُرْنَا عَلَىٰ مَنْ عَادَانَا، وَلَا تَجْعَلْ مُصِيبَتَنَا فِي دِينِنَا، وَلَا تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا وَلَا مَبْلَغَ عِلْمِنَا، وَلَا تُسَلِّطْ عَلَيْنَا مَنْ لَا يَرْحَمُنَا",
      transliteration:
        "«Алла́хумма-ксим ляна́ мин хашйатика ма́ яху́лу байнана́ ва байна ма‘а́сыйка, ва мин та́‘атика ма́ тубаллигуна́ бихи джаннатака, ва мина-ль-якы́ни ма́ тухаввину бихи ‘аляйна́ мусы́бати-д-дунья́, ва матти‘на́ би-асма́‘ина́ ва абса́рина́ ва кувватина́ ма́ ахйайтана́, вадж‘альху-ль-ва́риса минна́, вадж‘аль са’рана́ ‘аля́ ман залямана́, вансурна́ ‘аля́ ман ‘ада́на́, ва ля́ тадж‘аль мусы́батана́ фи́ ди́нина́, ва ля́ тадж‘али-д-дунья́ акбара хаммина́ ва ля́ мабляга ‘ильмина́, ва ля́ тусаллит ‘аляйна́ ман ля́ ярхамуна́».",
      translation:
        "«О Аллах, даруй нам такой страх перед Тобой, который удержит нас от ослушания Тебя, и такое повиновение Тебе, которое доведёт нас до Твоего Рая, и такую убеждённость, которая облегчит для нас беды этого мира. О Аллах, дай нам пользоваться нашим слухом, зрением и силой, пока Ты даруешь нам жизнь, и сделай это наследуемым для нас. Даруй нам отмщение тем, кто поступил с нами несправедливо, помоги нам против тех, кто враждует с нами, не делай нашу религию предметом нашего бедствия, не делай мир этот нашей величайшей заботой и пределом нашего знания и не ставь над нами тех, кто не проявит к нам милости».",
    },
    {
      id: 6,
      arabic:
        "اللَّهُمَّ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنْتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ",
      transliteration:
        "«Алла́хумма, Фа́тыра-с-самава́ти валь-арди, Анта валиййи́ фи-д-дунья́ валь-а́хирати, таваффани́ муслиман ва альхикни́ би-с-са́лихи́н».",
      translation:
        "«О Аллах, Творец небес и земли, Ты — мой Покровитель в этом мире и в Последней жизни. Умертви меня мусульманином и присоедини меня к праведникам».",
    },
    {
      id: 7,
      arabic:
        "اللَّهُمَّ أَعِنِّي عَلَى شُكْرِكَ، وَذِكْرِكَ، وَحُسْنِ عِبَادَتِكَ",
      transliteration:
        "«Алла́хумма а‘инни́ ‘аля́ шукрика, ва зикрика, ва хусни ‘иба́датик».",
      translation:
        "«О Аллах, помоги мне поминать Тебя, благодарить Тебя и поклоняться Тебе наилучшим образом».",
    },
    {
      id: 8,
      arabic: "اللَّهُمَّ أَحْسَنْتَ خَلْقِي فَأَحْسِنْ خُلُقِي",
      transliteration:
        "«Алла́хумма ахсанта хальки́ фа-ахсин хулуки́».",
      translation:
        "«О Аллах, Ты сделал прекрасным мой облик, так сделай прекрасным и мой нрав».",
    },
    {
      id: 9,
      arabic:
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَرَحْمَتِكَ، فَإِنَّهُ لَا يَمْلِكُهَا إِلَّا أَنْتَ",
      transliteration:
        "«Алла́хумма инни́ ас’алюка мин фадлика ва рахматика, фа-иннаху ля́ ямликуха́ илля́ Ант».",
      translation:
        "«О Аллах, поистине, я прошу у Тебя Твоей щедрости и милости, ибо никто, кроме Тебя, не владеет ими».",
    },
    {
      id: 10,
      arabic: "رَبِّ اشْرَحْ لِي صَدْرِي ۝ وَيَسِّرْ لِي أَمْرِي",
      transliteration:
        "«Рабби-шрах ли́ садри́ ва йассир ли́ амри́».",
      translation:
        "«Господи, раскрой для меня мою грудь и облегчи мне моё дело».",
    },
    {
      id: 11,
      arabic:
        "رَبَّنَا آمَنَّا بِمَا أَنْزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ",
      transliteration:
        "«Раббана́ а́манна́ бима́ анзальта ва-ттаба‘на-р-расу́ля фактубна́ ма‘а-ш-ша́хиди́н».",
      translation:
        "«Господь наш, мы уверовали в то, что Ты ниспослал, и последовали за посланником. Запиши же нас в число свидетельствующих».",
    },
    {
      id: 12,
      arabic: "رَبِّ زِدْنِي عِلْمًا",
      transliteration:
        "«Рабби зидни́ ‘ильма».",
      translation:
        "«Господи, прибавь мне знания».",
    },
    {
      id: 13,
      arabic:
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ حُبَّكَ، وَحُبَّ مَنْ يُحِبُّكَ، وَحُبَّ عَمَلٍ يُقَرِّبُنِي إِلَى حُبِّكَ",
      transliteration:
        "«Алла́хумма инни́ ас’алюка хýббака, ва хýбба ман юхи́ббука, ва хýбба ‘амалин юкаррибуни́ иля́ хýббик».",
      translation:
        "«О Аллах, поистине, я прошу у Тебя любви к Тебе, любви к тем, кто любит Тебя, и любви к делам, которые приближают меня к Твоей любви».",
    },
  ],
};
