export const chapterOne = {
  id: "dua-start",
  title: "ИСПРАШИВАНИЕ У АЛЛАХА РАЯ И ЗАЩИТЫ ОТ АДА",
  duas: [
    {
      id: 1,
      arabic: "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ",
      transliteration:
        "«Алла́хумма, инни́ ас'алюка-ль-Джанната\nва а'узу бика мина-н-На́р(и)».",
      translation: "«О, Аллах! Прошу у Тебя Рая\nи прибегаю к Твоей защите от Ада».",
    },
    {
      id: 2,
      arabic: "رَبِّ ابْنِ لِي عِندَكَ بَيْتًا فِي الْجَنَّةِ",
      transliteration: "«Рабби-бни ли́ 'индака байтан фи-ль-Джаннат(и)».",
      translation: "«О, Господь! Возведи мне дом в Раю».",
    },
    {
      id: 3,
      arabic:
        "رَبِّ أَلْحِقْنِي بِالصَّالِحِينَ ۝ وَاجْعَل لِّي لِسَانَ صِدْقٍ فِي الْآخِرِينَ ۝\nوَاجْعَلْنِي مِن وَرَثَةِ جَنَّةِ النَّعِيمِ ۝",
      transliteration:
        "«Рабби “Альхикни́ би-с-салихи́н(а), ва-дж'аль ли́ лиса́на сидкин\nфи-ль-а́хири́н(а), ва-дж'альни́ мин варасати джаннати-н-наи́м(и)».",
      translation:
        "«О, Господь! Воссоедини меня с праведниками. Оставь обо\nмне правдивую молву в последующих поколениях. Сделай\nменя одним из наследников Сада Блаженства».",
    },
    {
      id: 4,
      arabic: "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا",
      transliteration:
        "«Раббана̄-сриф 'анна̄ 'аза̄ба Джаха̄ннама, инна 'аза̄баха̄ кя̄на\nгара̄ма(н)».",
      translation:
        "«Господь наш! Отврати от нас мучения в Геене, поскольку\nмучения там не отступают».",
    },
    {
      id: 5,
      arabic:
        "اللَّهُمَّ رَبَّ جِبْرَائِيلَ وَمِيكَائِيلَ وَرَبَّ إِسْرَافِيلَ، أَعُوذُ بِكَ مِنْ حَرِّ النَّارِ وَمِنْ عَذَابِ الْقَبْرِ",
      transliteration:
        "«Алла́хумма Рабба Джибра́йля, ва Мика́йля, ва Рабба Исрафи́ля,\nа'у́зу бика мин харри-н-на́ри, ва мин 'аза́би-ль-кабр(и)».",
      translation:
        "«О, Аллах! Господь Джибраиля и Микаиля, и Господь\nИсрафиля. Прибегаю к Твоей защите от жара адского огня и\nот могильных мук».",
    },
  ],
};

export const chapterTwo = {
  id: "dua-forgiveness-mercy",
  title: "ИСПРАШИВАНИЕ У АЛЛАХА ПРОЩЕНИЯ И МИЛОСТИ",
  duas: [
    {
      id: 1,
      arabic: "رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ",
      transliteration: "«Раббана́ а́манна́ фа-гфир ляна́ зуну́бана, ва кына́ 'аза́ба-н-на́р(и)».",
      translation:
        "«Господь наш! Воистину, мы уверовали. Прости же нам наши грехи и защити нас от мучений в Огне».",
    },
    {
      id: 2,
      arabic:
        "وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ ۝ رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ ۝",
      transliteration:
        "«Ва каффир 'анна́ саййиа́тина ва таваффана́ ма'а-ль-абра́р(и).\nРаббана́ а́тина ма́ ва'адтана́ 'аля́ русулика ва ля́ тухзина́\nйаума-ль-кыя́мати иннакя́ ля́ тухлифу-ль-ми'а́д(а)».",
      translation:
        "«Отпусти нам наши прегрешения и умертви нас вместе с благочестивыми. Господь наш! Даруй нам то, что Ты обещал нам через Своих посланников, и не позорь нас в День воскресения, ведь Ты не нарушаешь обещаний».",
    },
    {
      id: 3,
      arabic: "رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا",
      transliteration: "«Раббана́-гфир ляна́ зуну́бана́ ва исра́фана́ фи́ амрина́».",
      translation:
        "«Господь наш! Прости нам наши грехи и излишества,\nкоторые мы допустили в нашем деле».",
    },
    {
      id: 4,
      arabic:
        "رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
      transliteration:
        "«Раббана́ залямна́ анфусана́ ва ин лям тагфир ляна́ ва\nтархамна́ ланаку́нанна мина-ль-ха́сири́н(а)».",
      translation:
        "«Господь наш! Мы поступили несправедливо по\nотношению к себе, и если Ты не простишь нас и не\nсмилостивишься над нами, то мы непременно окажемся\nодними из потерпевших урон».",
    },
    {
      id: 5,
      arabic: "رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الرَّاحِمِينَ",
      transliteration:
        "«Раббана́ а́манна́ фа-гфир ляна́ ва-рхамна́ ва Анта хайру-р-\nра́хими́н(а)».",
      translation:
        "«Господь наш! Мы уверовали. Прости же нас и помилуй,\nибо Ты — Наилучший из милосердных».",
    },
    {
      id: 6,
      arabic: "رَبِّ اغْفِرْ وَارْحَمْ وَأَنْتَ خَيْرُ الرَّاحِمِينَ",
      transliteration: "«Рабби-гфир, ва-рхам ва Анта хайрy-р-ра́хими́н(а)».",
      translation: "«Господи, прости и помилуй, ведь Ты — Наилучший из милосердных!»",
    },
    {
      id: 7,
      arabic:
        "رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ\nوَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَّحِيمٌ",
      transliteration:
        "«Раббана́-гфир ляна́ ва ли ихва́нина-ллязи́на сабаку́на би-ль-и́ма́ни, ва ля́ тадж'аль фи́ кулю́бина́ гилля-ль-лиллязи́на а́ману, Раббана́ иннака Ра'у́фун Рахи́м(ун)».",
      translation:
        "«Господь наш! Прости нас и наших братьев, которые уверовали раньше нас. Не насаждай в наших сердцах ненависти и зависти к тем, кто уверовал. Господь наш! Воистину, Ты — Сострадательный, Милосердный».",
    },
    {
      id: 8,
      arabic:
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللَّهُ، الْأَحَدُ الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ، أَنْ تَغْفِرَ لِي ذُنُوبِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
      transliteration:
        "«Алла́хумма инни́ ас'алюка йа́ Алла́ху, аль-Ахаду-с-Самаду, аль-лязи́ лям ялид ва лям ю́ляд, ва ля́м якун ляху́ куфуван ахада(ун), ан тагфира ли́ зуну́би, иннака Анта-ль-Гафу́ру-р-Рахи́м(у)».",
      translation:
        "«О Аллах! Поистине, я прошу Тебя, о Аллах, о Единый, Самодостаточный, Который не родил и не был рожден, Которому нет равных, простить мне мои грехи, поистине Ты Прощающий, Милосердный».",
    },
    {
      id: 9,
      arabic:
        "اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي، وَإِسْرَافِي فِي أَمْرِي، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، اللَّهُمَّ اغْفِرْ لِي جِدِّي وَهَزْلِي، وَخَطَئِي وَعَمْدِي، وَكُلُّ ذَلِكَ عِنْدِي، اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ، وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
      transliteration:
        "«Алла́хумма-гфир ли́ хати́'ати́ ва джахли́, ва исра́фи́ фи́ 'амри́, ва ма́ Анта а'ляму бини́ минни́. Алла́хумма-гфир ли́ джидди́ ва хазли́, ва хата́'и́ ва 'амди́, ва куллю за́лика 'инди́. Алла́хумма-гфир ли́ ма́ каддамту ва ма́ аххарту, ва ма́ асрарту ва ма́ а'лянту, ва ма́ Анта а'ляму бихи́ минни́. Анта-ль-Мукаддиму, ва Анта-ль-Му'аххиру, ва Анта 'аля́ кулли шай'ин кади́р(ун)».",
      translation:
        "«О Аллах! Прости мне мой грех и моё невежество, неумеренность в моих делах и то, о чём Ты знаешь лучше меня! О Аллах! Прости мне сделанное мной всерьёз и в шутку, по ошибке и намеренно, ибо всё это мне присуще. О Аллах! Прости мне совершённое мной прежде и то, что ещё не совершено, то, что я совершил тайно, и что совершил явно и то, о чём Ты знаешь лучше меня. Ты — Выдвигающий вперёд, и Ты — Отодвигающий назад и Ты надо всем властен».",
    },
  ],
};
